MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451LE6AE/mcu.h
 * |        |          |1 = Sample Module 7 interrupt Enabled.
 * |[8]     |SPLIE8    |Sample Module 8 Interrupt Enable Bit
 * |        |          |0 = Sample Module 8 interrupt Disabled.
 * |        |          |1 = Sample Module 8 interrupt Enabled.
 * |[9]     |SPLIE9    |Sample Module 9 Interrupt Enable Bit
 * |        |          |0 = Sample Module 9 interrupt Disabled.
 * |        |          |1 = Sample Module 9 interrupt Enabled.
 * |[10]    |SPLIE10   |Sample Module 10 Interrupt Enable Bit
 * |        |          |0 = Sample Module 10 interrupt Disabled.
 * |        |          |1 = Sample Module 10 interrupt Enabled.
 * |[11]    |SPLIE11   |Sample Module 11 Interrupt Enable Bit
 * |        |          |0 = Sample Module 11 interrupt Disabled.
 * |        |          |1 = Sample Module 11 interrupt Enabled.
 * |[12]    |SPLIE12   |Sample Module 12 Interrupt Enable Bit
 * |        |          |0 = Sample Module 12 interrupt Disabled.
 * |        |          |1 = Sample Module 12 interrupt Enabled.
 * |[13]    |SPLIE13   |Sample Module 13 Interrupt Enable Bit
 * |        |          |0 = Sample Module 13 interrupt Disabled.
 * |        |          |1 = Sample Module 13 interrupt Enabled.
 * |[14]    |SPLIE14   |Sample Module 14 Interrupt Enable Bit
 * |        |          |0 = Sample Module 14 interrupt Disabled.
 * |        |          |1 = Sample Module 14 interrupt Enabled.
 * |[15]    |SPLIE15   |Sample Module 15 Interrupt Enable Bit
 * |        |          |0 = Sample Module 15 interrupt Disabled.
 * |        |          |1 = Sample Module 15 interrupt Enabled.
 * |[16]    |SPLIE16   |Sample Module 16 Interrupt Enable Bit
 * |        |          |0 = Sample Module 16 interrupt Disabled.
 * |        |          |1 = Sample Module 16 interrupt Enabled.
 * |[17]    |SPLIE17   |Sample Module 17 Interrupt Enable Bit
 * |        |          |0 = Sample Module 17 interrupt Disabled.
 * |        |          |1 = Sample Module 17 interrupt Enabled.
 * |[18]    |SPLIE18   |Sample Module 18 Interrupt Enable Bit
 * |        |          |0 = Sample Module 18 interrupt Disabled.
 * |        |          |1 = Sample Module 18 interrupt Enabled.
 * @var EADC_T::CMP
 * Offset: 0xEC  A/D Result Compare Register n, n=0~3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADCMPEN   |A/D Result Compare Enable Bit
 * |        |          |0 = Compare Disabled.
 * |        |          |1 = Compare Enabled.
 * |        |          |Set this bit to 1 to enable compare CMPDAT (EADC_CMPn[27:16], n=0~3) with specified sample module conversion result when converted data is loaded into EADC_DAT register.
 * |[1]     |ADCMPIE   |A/D Result Compare Interrupt Enable Bit
 * |        |          |0 = Compare function interrupt Disabled.
 * |        |          |1 = Compare function interrupt Enabled.
 * |        |          |If the compare function is enabled and the compare condition matches the setting of CMPCOND (EADC_CMPn[2], n=0~3) and CMPMCNT (EADC_CMPn[11:8], n=0~3), ADCMPFn (EADC_STATUS2[7:4], n=0~3) will be asserted, in the meanwhile, if ADCMPIE is set to 1, a compare interrupt request is generated.
 * |[2]     |CMPCOND   |Compare Condition
 * |        |          |0= Set the compare condition as that when a 12-bit A/D conversion result is less than the 12-bit CMPDAT (EADC_CMPn
 * |        |          |[27:16]), the internal match counter will increase one.
 * |        |          |1= Set the compare condition as that when a 12-bit A/D conversion result is greater or equal to the 12-bit CMPDAT (EADC_CMPn [27:16]), the internal match counter will increase one.
 * |        |          |Note: When the internal counter reaches the value to (CMPMCNT (EADC_CMPn[11:8], n=0~3) +1), the CMPF bit will be set.
 * |[7:3]   |CMPSPL    |Compare Sample Module Selection
 * |        |          |00000 = Sample Module 0 conversion result EADC_DAT0 is selected to be compared.
 * |        |          |00001 = Sample Module 1 conversion result EADC_DAT1 is selected to be compared.
 * |        |          |00010 = Sample Module 2 conversion result EADC_DAT2 is selected to be compared.
 * |        |          |00011 = Sample Module 3 conversion result EADC_DAT3 is selected to be compared.
 * |        |          |00100 = Sample Module 4 conversion result EADC_DAT4 is selected to be compared.
 * |        |          |00101 = Sample Module 5 conversion result EADC_DAT5 is selected to be compared.
 * |        |          |00110 = Sample Module 6 conversion result EADC_DAT6 is selected to be compared.
 * |        |          |00111 = Sample Module 7 conversion result EADC_DAT7 is selected to be compared.
 * |        |          |01000 = Sample Module 8 conversion result EADC_DAT8 is selected to be compared.
 * |        |          |01001 = Sample Module 9 conversion result EADC_DAT9 is selected to be compared.
 * |        |          |01010 = Sample Module 10 conversion result EADC_DAT10 is selected to be compared.
 * |        |          |01011 = Sample Module 11 conversion result EADC_DAT11 is selected to be compared.
 * |        |          |01100 = Sample Module 12 conversion result EADC_DAT12 is selected to be compared.
 * |        |          |01101 = Sample Module 13 conversion result EADC_DAT13 is selected to be compared.
 * |        |          |01110 = Sample Module 14 conversion result EADC_DAT14 is selected to be compared.
 * |        |          |01111 = Sample Module 15 conversion result EADC_DAT15 is selected to be compared.
 * |        |          |10000 = Sample Module 16 conversion result EADC_DAT16 is selected to be compared.
 * |        |          |10001 = Sample Module 17 conversion result EADC_DAT17 is selected to be compared.
 * |        |          |10010 = Sample Module 18 conversion result EADC_DAT18 is selected to be compared.
 * |[11:8]  |CMPMCNT   |Compare Match Count
 * |        |          |When the specified A/D sample module analog conversion result matches the compare condition defined by CMPCOND (EADC_CMPn[2], n=0~3), the internal match counter will increase 1.
 * |        |          |If the compare result does not meet the compare condition, the internal compare match counter will reset to 0.
 * |        |          |When the internal counter reaches the value to (CMPMCNT +1), the ADCMPFn (EADC_STATUS2[7:4], n=0~3) will be set.
 * |[15]    |CMPWEN    |Compare Window Mode Enable Bit
 * |        |          |0 = ADCMPF0 (EADC_STATUS2[4]) will be set when EADC_CMP0 compared condition matched.
 * |        |          |ADCMPF2 (EADC_STATUS2[6]) will be set when EADC_CMP2 compared condition matched.
 * |        |          |1 = ADCMPF0 (EADC_STATUS2[4]) will be set when both EADC_CMP0 and EADC_CMP1 compared condition matched.
 * |        |          |ADCMPF2 (EADC_STATUS2[6]) will be set when both EADC_CMP2 and EADC_CMP3 compared condition matched.
 * |        |          |Note: This bit is only present in EADC_CMP0 and EADC_CMP2 register.
 * |[27:16] |CMPDAT    |Comparison Data
 * |        |          |The 12 bits data is used to compare with conversion result of specified sample module.
 * |        |          |User can use it to monitor the external analog input pin voltage transition without imposing a load on software.
 * @var EADC_T::STATUS0
 * Offset: 0xF0  A/D Status Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |VALID     |EADC_DAT0~15 Data Valid Flag
 * |        |          |It is a mirror of VALID bit in sample module A/D result data register EADC_DATn. (n=0~18).
 * |[31:16] |OV        |EADC_DAT0~15 Overrun Flag
 * |        |          |It is a mirror to OV bit in sample module A/D result data register EADC_DATn. (n=0~18).
 * @var EADC_T::STATUS1
 * Offset: 0xF4  A/D Status Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |VALID     |EADC_DAT16~18 Data Valid Flag
 * |        |          |It is a mirror of VALID bit in sample module A/D result data register EADC_DATn. (n=0~18).
 * |[18:16] |OV        |EADC_DAT16~18 Overrun Flag
 * |        |          |It is a mirror to OV bit in sample module A/D result data register EADC_DATn. (n=0~18).
 * @var EADC_T::STATUS2
 * Offset: 0xF8  A/D Status Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ADIF0     |A/D ADINT0 Interrupt Flag
 * |        |          |0 = No ADINT0 interrupt pulse received.
 * |        |          |1 = ADINT0 interrupt pulse has been received.
 * |        |          |Note1: This bit is cleared by writing 1 to it.
 * |        |          |Note2:This bit indicates whether an A/D conversion of specific sample module has been completed
 * |[1]     |ADIF1     |A/D ADINT1 Interrupt Flag
 * |        |          |0 = No ADINT1 interrupt pulse received.
 * |        |          |1 = ADINT1 interrupt pulse has been received.
 * |        |          |Note1: This bit is cleared by writing 1 to it.
 * |        |          |Note2:This bit indicates whether an A/D conversion of specific sample module has been completed
 * |[2]     |ADIF2     |A/D ADINT2 Interrupt Flag
 * |        |          |0 = No ADINT2 interrupt pulse received.
 * |        |          |1 = ADINT2 interrupt pulse has been received.
 * |        |          |Note1: This bit is cleared by writing 1 to it.
 * |        |          |Note2:This bit indicates whether an A/D conversion of specific sample module has been completed
 * |[3]     |ADIF3     |A/D ADINT3 Interrupt Flag
 * |        |          |0 = No ADINT3 interrupt pulse received.
 * |        |          |1 = ADINT3 interrupt pulse has been received.
 * |        |          |Note1: This bit is cleared by writing 1 to it.
 * |        |          |Note2:This bit indicates whether an A/D conversion of specific sample module has been completed
 * |[4]     |ADCMPF0   |ADC Compare 0 Flag
 * |        |          |When the specific sample module A/D conversion result meets setting condition in EADC_CMP0 then this bit is set to 1.
 * |        |          |0 = Conversion result in EADC_DAT does not meet EADC_CMP0 register setting.
 * |        |          |1 = Conversion result in EADC_DAT meets EADC_CMP0 register setting.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[5]     |ADCMPF1   |ADC Compare 1 Flag
 * |        |          |When the specific sample module A/D conversion result meets setting condition in EADC_CMP1 then this bit is set to 1.
 * |        |          |0 = Conversion result in EADC_DAT does not meet EADC_CMP1 register setting.
 * |        |          |1 = Conversion result in EADC_DAT meets EADC_CMP1 register setting.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[6]     |ADCMPF2   |ADC Compare 2 Flag
 * |        |          |When the specific sample module A/D conversion result meets setting condition in EADC_CMP2 then this bit is set to 1.
 * |        |          |0 = Conversion result in EADC_DAT does not meet EADC_CMP2 register setting.
 * |        |          |1 = Conversion result in EADC_DAT meets EADC_CMP2 register setting.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[7]     |ADCMPF3   |ADC Compare 3 Flag
 * |        |          |When the specific sample module A/D conversion result meets setting condition in EADC_CMP3 then this bit is set to 1.
 * |        |          |0 = Conversion result in EADC_DAT does not meet EADC_CMP3 register setting.
 * |        |          |1 = Conversion result in EADC_DAT meets EADC_CMP3 register setting.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[8]     |ADOVIF0   |A/D ADINT0 Interrupt Flag Overrun
 * |        |          |0 = ADINT0 interrupt flag is not overwritten to 1.
 * |        |          |1 = ADINT0 interrupt flag is overwritten to 1.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[9]     |ADOVIF1   |A/D ADINT1 Interrupt Flag Overrun
 * |        |          |0 = ADINT1 interrupt flag is not overwritten to 1.
 * |        |          |1 = ADINT1 interrupt flag is overwritten to 1.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[10]    |ADOVIF2   |A/D ADINT2 Interrupt Flag Overrun
 * |        |          |0 = ADINT2 interrupt flag is not overwritten to 1.
 * |        |          |1 = ADINT2 interrupt flag is s overwritten to 1.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[11]    |ADOVIF3   |A/D ADINT3 Interrupt Flag Overrun
 * |        |          |0 = ADINT3 interrupt flag is not overwritten to 1.
 * |        |          |1 = ADINT3 interrupt flag is overwritten to 1.
 * |        |          |Note: This bit is cleared by writing 1 to it.
 * |[12]    |ADCMPO0   |ADC Compare 0 Output Status
 * |        |          |The 12 bits compare0 data CMPDAT0 (EADC_CMP0[27:16]) is used to compare with conversion result of specified sample module.
 * |        |          |User can use it to monitor the external analog input pin voltage status.
 * |        |          |0 = Conversion result in EADC_DAT less than CMPDAT0 setting.
 * |        |          |1 = Conversion result in EADC_DAT great than or equal CMPDAT0
 * |        |          |setting.
 * |[13]    |ADCMPO1   |ADC Compare 1 Output Status
 * |        |          |The 12 bits compare1 data CMPDAT1 (EADC_CMP1[27:16]) is used to compare with conversion result of specified sample module.
 * |        |          |User can use it to monitor the external analog input pin voltage status.
 * |        |          |0 = Conversion result in EADC_DAT less than CMPDAT1 setting.
 * |        |          |1 = Conversion result in EADC_DAT great than or equal CMPDAT1
 * |        |          |setting.
 * |[14]    |ADCMPO2   |ADC Compare 2 Output Status
 * |        |          |The 12 bits compare2 data CMPDAT2 (EADC_CMP2[27:16]) is used to compare with conversion result of specified sample module.
 * |        |          |User can use it to monitor the external analog input pin voltage status.
 * |        |          |0 = Conversion result in EADC_DAT less than CMPDAT2 setting.
 * |        |          |1 = Conversion result in EADC_DAT great than or equal CMPDAT2
 * |        |          |setting.
 * |[15]    |ADCMPO3   |ADC Compare 3 Output Status
 * |        |          |The 12 bits compare3 data CMPDAT3 (EADC_CMP3[27:16]) is used to compare with conversion result of specified sample module.
 * |        |          |User can use it to monitor the external analog input pin voltage status.
 * |        |          |0 = Conversion result in EADC_DAT less than CMPDAT3 setting.
 * |        |          |1 = Conversion result in EADC_DAT great than or equal CMPDAT3
 * |        |          |setting.
 * |[20:16] |CHANNEL   |Current Conversion Channel
 * |        |          |This filed reflects ADC current conversion channel when BUSY=1.
 * |        |          |It is read only.
 * |        |          |00H = EADC_CH0.
 * |        |          |01H = EADC_CH1.
 * |        |          |02H = EADC_CH2.
 * |        |          |03H = EADC_CH3.
 * |        |          |04H = EADC_CH4.
 * |        |          |05H = EADC_CH5.
 * |        |          |06H = EADC_CH6.
 * |        |          |07H = EADC_CH7.
 * |        |          |08H = EADC_CH8.
 * |        |          |09H = EADC_CH9.
 * |        |          |0AH = EADC_CH10.
 * |        |          |0BH = EADC_CH11.
 * |        |          |0CH = EADC_CH12.
 * |        |          |0DH = EADC_CH13.
 * |        |          |0EH = EADC_CH14.
 * |        |          |0FH = EADC_CH15.
 * |        |          |10H = VBG.
 * |        |          |11H = VTEMP.
 * |        |          |12H = VBAT.
 * |[23]    |BUSY      |Busy/Idle
 * |        |          |0 = EADC is in idle state.
 * |        |          |1 = EADC is busy at conversion.
 * |        |          |Note: This bit is read only.
 * |[24]    |ADOVIF    |All A/D Interrupt Flag Overrun Bits Check
 * |        |          |n=0~3.
 * |        |          |0 = None of ADINT interrupt flag ADOVIFn (EADC_STATUS2[11:8]) is overwritten to 1.
 * |        |          |1 = Any one of ADINT interrupt flag ADOVIFn (EADC_STATUS2[11:8]) is overwritten to 1.
 * |        |          |Note: This bit will keep 1 when any ADOVIFn Flag is equal to 1.
 * |[25]    |STOVF     |For All A/D Sample Module Start Of Conversion Overrun Flags Check
 * |        |          |n=0~18.
 * |        |          |0 = None of sample module event overrun flag SPOVFn (EADC_OVSTS[n]) is set to 1.
 * |        |          |1 = Any one of sample module event overrun flag SPOVFn (EADC_OVSTS[n]) is set to 1.
 * |        |          |Note: This bit will keep 1 when any SPOVFn Flag is equal to 1.
 * |[26]    |AVALID    |For All Sample Module A/D Result Data Register EADC_DAT Data Valid Flag Check
 * |        |          |n=0~18.
 * |        |          |0 = None of sample module data register valid flag VALIDn (EADC_DATn[17]) is set to 1.
 * |        |          |1 = Any one of sample module data register valid flag VALIDn (EADC_DATn[17]) is set to 1.
 * |        |          |Note: This bit will keep 1 when any VALIDn Flag is equal to 1.
 * |[27]    |AOV       |For All Sample Module A/D Result Data Register Overrun Flags Check
 * |        |          |n=0~18.
 * |        |          |0 = None of sample module data register overrun flag OVn (EADC_DATn[16]) is set to 1.
 * |        |          |1 = Any one of sample module data register overrun flag OVn (EADC_DATn[16]) is set to 1.
 * |        |          |Note: This bit will keep 1 when any OVn Flag is equal to 1.
 * @var EADC_T::STATUS3
 * Offset: 0xFC  A/D Status Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:0]   |CURSPL    |ADC Current Sample Module
 * |        |          |This register show the current ADC is controlled by which sample module control logic modules.
 * |        |          |If the ADC is Idle, this bit filed will set to 0x1F.
 * |        |          |This is a read only register.
 * @var EADC_T::DDAT
 * Offset: 0x100-0x10C  A/D Double Data Register n for Sample Module n, n=0~3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |RESULT    |A/D Conversion Results
 * |        |          |This field contains 12 bits conversion results.
 * |        |          |When the DMOF (EADC_CTL[9]) is set to 0, 12-bit ADC conversion result with unsigned format will be filled in RESULT [11:0] and zero will be filled in RESULT [15:12].
 * |        |          |When DMOF (EADC_CTL[9]) set to 1, 12-bit ADC conversion result with 2'complement format will be filled in RESULT [11:0] and signed bits to will be filled in RESULT [15:12].
 * |[16]    |OV        |Overrun Flag
 * |        |          |0 = Data in RESULT (EADC_DATn[15:0], n=0~3) is recent conversion result.
 * |        |          |1 = Data in RESULT (EADC_DATn[15:0], n=0~3) is overwrite.
 * |        |          |If converted data in RESULT[15:0] has not been read before new conversion result is loaded to this register, OV is set to 1.
 * |        |          |It is cleared by hardware after EADC_DDAT register is read.
 * |[17]    |VALID     |Valid Flag
 * |        |          |0 = Double data in RESULT (EADC_DDATn[15:0]) is not valid.
 * |        |          |1 = Double data in RESULT (EADC_DDATn[15:0]) is valid.
 * |        |          |This bit is set to 1 when corresponding sample module channel analog input conversion is completed and cleared by hardware after EADC_DDATn register is read.
 * |        |          |(n=0~3).
 */

    __I  uint32_t DAT[19];       /* Offset: 0x00-0x48  A/D Data Register n for Sample Module n, n=0~18               */
    __I  uint32_t CURDAT;        /* Offset: 0x4C  EADC PDMA Current Transfer Data Register                           */
    __IO uint32_t CTL;           /* Offset: 0x50  A/D Control Register                                               */
    __O  uint32_t SWTRG;         /* Offset: 0x54  A/D Sample Module Software Start Register                          */
    __IO uint32_t PENDSTS;       /* Offset: 0x58  A/D Start of Conversion Pending Flag Register                      */
    __IO uint32_t OVSTS;         /* Offset: 0x5C  A/D Sample Module Start of Conversion Overrun Flag Register        */
    __I  uint32_t RESERVE0[8];  
    __IO uint32_t SCTL[19];      /* Offset: 0x80-0xC8  A/D Sample Module n Control Register, n=0~3                   */
    __I  uint32_t RESERVE1[1];  
    __IO uint32_t INTSRC[4];     /* Offset: 0xDC  ADC interrupt n Source Enable Control Register, n=0~3              */
    __IO uint32_t CMP[4];        /* Offset: 0xEC  A/D Result Compare Register n, n=0~3                               */
    __I  uint32_t STATUS0;       /* Offset: 0xF0  A/D Status Register 0                                              */
    __I  uint32_t STATUS1;       /* Offset: 0xF4  A/D Status Register 1                                              */
    __IO uint32_t STATUS2;       /* Offset: 0xF8  A/D Status Register 2                                              */
    __I  uint32_t STATUS3;       /* Offset: 0xFC  A/D Status Register 3                                              */
    __I  uint32_t DDAT[4];       /* Offset: 0x100-0x10C  A/D Double Data Register n for Sample Module n, n=0~3       */

} EADC_T;



/**
    @addtogroup EADC_CONST EADC Bit Field Definition
    Constant Definitions for EADC Controller
@{ */
#define EADC_DAT_RESULT_Pos               (0)                                               /*!< EADC_T::DAT: RESULT Position              */
#define EADC_DAT_RESULT_Msk               (0xfffful << EADC_DAT_RESULT_Pos)                 /*!< EADC_T::DAT: RESULT Mask                  */

#define EADC_DAT_OV_Pos                   (16)                                              /*!< EADC_T::DAT: OV Position                  */
#define EADC_DAT_OV_Msk                   (0x1ul << EADC_DAT_OV_Pos)                        /*!< EADC_T::DAT: OV Mask                      */

#define EADC_DAT_VALID_Pos                (17)                                              /*!< EADC_T::DAT: VALID Position               */
#define EADC_DAT_VALID_Msk                (0x1ul << EADC_DAT_VALID_Pos)                     /*!< EADC_T::DAT: VALID Mask                   */

