MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451LE6AE/mcu.h
#define GPIO_DRVCTL_HDRVEN10_Pos         (10)                                              /*!< GPIO_T::DRVCTL: HDRVEN10 Position         */
#define GPIO_DRVCTL_HDRVEN10_Msk         (0x1ul << GPIO_DRVCTL_HDRVEN10_Pos)               /*!< GPIO_T::DRVCTL: HDRVEN10 Mask             */

#define GPIO_DRVCTL_HDRVEN11_Pos         (11)                                              /*!< GPIO_T::DRVCTL: HDRVEN11 Position         */
#define GPIO_DRVCTL_HDRVEN11_Msk         (0x1ul << GPIO_DRVCTL_HDRVEN11_Pos)               /*!< GPIO_T::DRVCTL: HDRVEN11 Mask             */

#define GPIO_DRVCTL_HDRVEN12_Pos         (12)                                              /*!< GPIO_T::DRVCTL: HDRVEN12 Position         */
#define GPIO_DRVCTL_HDRVEN12_Msk         (0x1ul << GPIO_DRVCTL_HDRVEN12_Pos)               /*!< GPIO_T::DRVCTL: HDRVEN12 Mask             */

#define GPIO_DRVCTL_HDRVEN13_Pos         (13)                                              /*!< GPIO_T::DRVCTL: HDRVEN13 Position         */
#define GPIO_DRVCTL_HDRVEN13_Msk         (0x1ul << GPIO_DRVCTL_HDRVEN13_Pos)               /*!< GPIO_T::DRVCTL: HDRVEN13 Mask             */

#define GPIO_DBCTL_DBCLKSEL_Pos          (0)                                               /*!< GPIO_T::DBCTL: DBCLKSEL Position          */
#define GPIO_DBCTL_DBCLKSEL_Msk          (0xFul << GPIO_DBCTL_DBCLKSEL_Pos)                /*!< GPIO_T::DBCTL: DBCLKSEL Mask              */

#define GPIO_DBCTL_DBCLKSRC_Pos          (4)                                               /*!< GPIO_T::DBCTL: DBCLKSRC Position          */
#define GPIO_DBCTL_DBCLKSRC_Msk          (1ul << GPIO_DBCTL_DBCLKSRC_Pos)                  /*!< GPIO_T::DBCTL: DBCLKSRC Mask              */

#define GPIO_DBCTL_ICLKON_Pos            (5)                                               /*!< GPIO_T::DBCTL: ICLKON Position            */
#define GPIO_DBCTL_ICLKON_Msk            (1ul << GPIO_DBCTL_ICLKON_Pos)                    /*!< GPIO_T::DBCTL: ICLKON Mask                */


/**@}*/ /* GPIO_CONST */
/**@}*/ /* end of GPIO register group */


/*---------------------- Inter-IC Bus Controller -------------------------*/
/**
    @addtogroup I2C Inter-IC Bus Controller(I2C)
    Memory Mapped Structure for I2C Controller
@{ */


typedef struct
{




/**
 * @var I2C_T::CTL
 * Offset: 0x00  I2C Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2]     |AA        |Assert Acknowledge Control
 * |        |          |When AA =1 prior to address or data is received, 
 * |        |          |an acknowledged (low level to SDA) will be returned during the acknowledge clock pulse on the SCL line when 
 * |        |          |1. A slave is acknowledging the address sent from master. 
 * |        |          |2. The receiver devices are acknowledging the data sent by transmitter.
 * |        |          |When AA=0 prior to address or data received, 
 * |        |          |a Not acknowledged (high level to SDA) will be returned during the acknowledge clock pulse on the SCL line.
 * |[3]     |SI        |I2C Interrupt Flag
 * |        |          |When a new I2C state is present in the I2C_STATUS register, the SI flag is set by hardware.
 * |        |          |If bit INTEN (I2C_CTL [7]) is set, the I2C interrupt is requested.
 * |        |          |SI must be cleared by software.
 * |        |          |Clear SI by writing 1 to this bit.
 * |        |          |For ACKMEN is set in slave read mode, the SI flag is set in 8th clock period for user to confirm the acknowledge bit and 9th clock period for user to read the data in the data buffer.
 * |[4]     |STO       |I2C STOP Control
 * |        |          |In Master mode, setting STO to transmit a STOP condition to bus then I2C controller will check the bus condition if a STOP condition is detected.
 * |        |          |This bit will be cleared by hardware automatically.
 * |[5]     |STA       |I2C START Control
 * |        |          |Setting STA to logic 1 to enter Master mode, the I2C hardware sends a START or repeat START condition to bus when the bus is free.
 * |[6]     |I2CEN     |I2C Controller Enable Bit
 * |        |          |Set to enable I2C serial function controller.
 * |        |          |When I2CEN=1 the I2C serial function enable.
 * |        |          |The multi-function pin function must set to SDA, and SCL of I2C function first.
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[7]     |INTEN     |Enable Interrupt
 * |        |          |0 = I2C interrupt Disabled.
 * |        |          |1 = I2C interrupt Enabled.
 * @var I2C_T::ADDR0
 * Offset: 0x04  I2C Slave Address Register0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[7:1]   |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode.
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chip's own address.
 * |        |          |The I2C hardware will react if either of the address is matched.
 * @var I2C_T::DAT
 * Offset: 0x08  I2C Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |DAT       |I2C Data
 * |        |          |Bit [7:0] is located with the 8-bit transferred/received data of I2C serial port.
 * @var I2C_T::STATUS
 * Offset: 0x0C  I2C Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |STATUS    |I2C Status
 * |        |          |The three least significant bits are always 0.
 * |        |          |The five most significant bits contain the status code.
 * |        |          |There are 28 possible status codes.
 * |        |          |When the content of I2C_STATUS is F8H, no serial interrupt is requested.
 * |        |          |Others I2C_STATUS values correspond to defined I2C states.
 * |        |          |When each of these states is entered, a status interrupt is requested (SI = 1).
 * |        |          |A valid status code is present in I2C_STATUS one cycle after SI is set by hardware and is still present one cycle after SI has been reset by software.
 * |        |          |In addition, states 00H stands for a Bus Error.
 * |        |          |A Bus Error occurs when a START or STOP condition is present at an illegal position in the formation frame.
 * |        |          |Example of illegal position are during the serial transfer of an address byte, a data byte or an acknowledge bit.
 * |        |          |Note:
 * |        |          |1.
 * |        |          |If the BUSEN and ACKMEN are enabled in slave received mode, there is SI interrupt in the 8th clock.
 * |        |          |The user can read the I2C_STATUS = 0xf0 for the function condition has done.
 * |        |          |2.
 * |        |          |If the BUSEN and PECEN are enabled, the status of PECERR, I2C_BUSSTS[3], is used to substitute for I2C_STATUS to check the ACK status in the last frame when the byte count done interrupt has active and the PEC frame has been transformed.
 * @var I2C_T::CLKDIV
 * Offset: 0x10  I2C Clock Divided Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |DIVIDER   |I2C Clock Divided
 * |        |          |Indicates the I2C clock rate: Data Baud Rate of I2C = (system clock) / (4x (I2C_CLKDIV+1)).
 * |        |          |Note: The minimum value of I2C_CLKDIV is 4.
 * @var I2C_T::TOCTL
 * Offset: 0x14  I2C Time-out Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TOIF      |Time-Out Flag
 * |        |          |This bit is set by hardware when I2C time-out happened and it can interrupt CPU if I2C interrupt enable bit (INTEN) is set to 1.
 * |        |          |Note: Software can write 1 to clear this bit.
 * |[1]     |TOCDIV4   |Time-Out Counter Input Clock Divided By 4
 * |        |          |When Enabled, The time-out period is extend 4 times.
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[2]     |TOCEN     |Time-Out Counter Enable Bit
 * |        |          |When Enabled, the 14-bit time-out counter will start counting when SI is clear.
 * |        |          |Setting flag SI to '1' will reset counter and re-start up counting after SI is cleared.
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * @var I2C_T::ADDR1
 * Offset: 0x18  I2C Slave Address Register1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[7:1]   |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode.
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chip's own address.
 * |        |          |The I2C hardware will react if either of the address is matched.
 * @var I2C_T::ADDR2
 * Offset: 0x1C  I2C Slave Address Register2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[7:1]   |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode.
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chip's own address.
 * |        |          |The I2C hardware will react if either of the address is matched.
 * @var I2C_T::ADDR3
 * Offset: 0x20  I2C Slave Address Register3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |GC        |General Call Function
 * |        |          |0 = General Call Function Disabled.
 * |        |          |1 = General Call Function Enabled.
 * |[7:1]   |ADDR      |I2C Address
 * |        |          |The content of this register is irrelevant when I2C is in Master mode.
 * |        |          |In the slave mode, the seven most significant bits must be loaded with the chip's own address.
 * |        |          |The I2C hardware will react if either of the address is matched.
 * @var I2C_T::ADDRMSK0
 * Offset: 0x24  I2C Slave Address Mask Register0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:1]   |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is don't care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register.
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is don't-care.
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * @var I2C_T::ADDRMSK1
 * Offset: 0x28  I2C Slave Address Mask Register1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:1]   |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is don't care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register.
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is don't-care.
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * @var I2C_T::ADDRMSK2
 * Offset: 0x2C  I2C Slave Address Mask Register2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:1]   |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is don't care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register.
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is don't-care.
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * @var I2C_T::ADDRMSK3
 * Offset: 0x30  I2C Slave Address Mask Register3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:1]   |ADDRMSK   |I2C Address Mask
 * |        |          |0 = Mask Disabled (the received corresponding register bit should be exact the same as address register.).
 * |        |          |1 = Mask Enabled (the received corresponding address bit is don't care.).
 * |        |          |I2C bus controllers support multiple address recognition with four address mask register.
 * |        |          |When the bit in the address mask register is set to one, it means the received corresponding address bit is don't-care.
 * |        |          |If the bit is set to zero, that means the received corresponding register bit should be exact the same as address register.
 * @var I2C_T::WKCTL
 * Offset: 0x3C  I2C Wake-up Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKEN      |I2C Wake-Up Enable Bit
 * |        |          |0 = I2C wake-up function Disabled.
 * |        |          |1= I2C wake-up function Enabled.
 * @var I2C_T::WKSTS
 * Offset: 0x40  I2C Wake-up Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKIF      |I2C Wake-Up Flag
 * |        |          |When chip is woken up from Power-down mode by I2C, this bit is set to 1.
 * |        |          |Software can write 1 to clear this bit.
 * @var I2C_T::BUSCTL
 * Offset: 0x44  I2C Bus Management Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ACKMEN    |Acknowledge Control By Manual
 * |        |          |In order to allow ACK control in slave reception including the command and data, slave byte control mode must be enabled by setting the ACKMEN bit.
 * |        |          |0 = Slave byte control Disabled.
 * |        |          |1 = Slave byte control Enabled.
 * |        |          |The 9th bit can response the ACK or NACK according the received data by user.
 * |        |          |When the byte is received, stretching the SCLK signal low between the 8th and 9th SCLK pulse.
 * |        |          |Note: If the BMDEN =1 and this bit is enabled, the information of I2C_STATUS will be fixed as 0xF0 in slave receive condition.
 * |[1]     |PECEN     |Packet Error Checking Calculation Enable Bit
 * |        |          |0 = Packet Error Checking Calculation Disabled.
 * |        |          |1 = Packet Error Checking Calculation Enabled.
 * |[2]     |BMDEN     |Bus Management Device Default Address Enable Bit
 * |        |          |0 = Device default address Disable.
 * |        |          |When the address 0'b1100001x coming and the both of BMDEN and ACKMEN are enabled, the device responses NACKed.
 * |        |          |1 = Device default address Enabled.
 * |        |          |When the address 0'b1100001x coming and the both of BMDEN and ACKMEN are enabled, the device responses ACKed.
 * |[3]     |BMHEN     |Bus Management Host Enable Bit
 * |        |          |0 = Host function Disabled.
 * |        |          |1 = Host function Enabled and the SUSCON will be used as CONTROL function.
 * |[4]     |ALERTEN   |Bus Management Alert Enable Bit
 * |        |          |Device Mode (BMHEN =0).
 * |        |          |0 = Release the BM_ALERT pin high and Alert Response Header disabled: 0001100x followed by NACK if both of BMDEN and ACKMEN are enabled.
 * |        |          |1 = Drive BM_ALERT pin low and Alert Response Address Header enables: 0001100x followed by ACK if both of BMDEN and ACKMEN are enabled.
 * |        |          |Host Mode (BMHEN =1).
 * |        |          |0 = BM_ALERT pin not supported.
 * |        |          |1 = BM_ALERT pin supported.
 * |[5]     |SCTLOSTS  |Suspend/Control Data Output Status
 * |        |          |0 = The output of SUSCON pin is low.
 * |        |          |1 = The output of SUSCON pin is high.
 * |[6]     |SCTLOEN   |Suspend Or Control Pin Output Enable Bit
 * |        |          |0 = The SUSCON pin in input.
 * |        |          |1 = The output enable is active on the SUSCON pin.
 * |[7]     |BUSEN     |BUS Enable Bit
 * |        |          |0 = The system management function is Disabled.
 * |        |          |1 = The system management function is Enable.
 * |        |          |Note: When the bit is enabled, the internal 14-bit counter is used to calculate the time out event of clock low condition.
 * |[8]     |PECTXEN   |Packet Error Checking Byte Transmission/Reception
 * |        |          |This bit is set by software, and cleared by hardware when the PEC is transferred, or when a STOP condition or an Address Matched is received
 * |        |          |0 = No PEC transfer.
 * |        |          |1 = PEC transmission/reception is requested.
 * |        |          |Note: 1.This bit has no effect in slave mode when ACKMEN =0.
 * |[9]     |TIDLE     |Timer Check In Idle State
 * |        |          |The BUSTOUT is used to calculate the time-out of clock low in bus active and the idle period in bus Idle.
 * |        |          |This bit is used to define which condition is enabled.
 * |        |          |0 = The BUSTOUT is used to calculate the clock low period in bus active.
 * |        |          |1 = The BUSTOUT is used to calculate the IDLE period in bus Idle.
 * |        |          |Note: The BUSY (I2C_BUSSTS[0]) indicate the current bus state.
 * |[10]    |PECCLR    |PEC Clear At Repeat Start
 * |        |          |The calculation of PEC starts when PECEN is set to 1 and it is clear when the STA or STO bit is detected.
 * |        |          |This PECCLR bit is used to enable the condition of REPEAT START can clear the PEC calculation.
 * |        |          |0 = The PEC calculation is cleared by "Repeat Start" function is Disabled.
 * |        |          |1 = The PEC calculation is cleared by "Repeat Start" function is Enabled.
 * |[11]    |ACKM9SI   |Acknowledge Manual Enable Extra SI Interrupt
 * |        |          |0 = There is no SI interrupt in the 9th clock cycle when the BUSEN =1 and ACKMEN =1.
 * |        |          |1 = There is SI interrupt in the 9th clock cycle when the BUSEN =1 and ACKMEN =1.
 * @var I2C_T::BUSTCTL
 * Offset: 0x48  I2C Bus Management Timer Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BUSTOEN   |Bus Time Out Enable Bit
 * |        |          |0 = Indicates the bus clock low time-out detection is Disabled.
 * |        |          |1 = Indicates the bus clock low time-out detection is Enabled 
 * |        |          |bus clock is low for more than Time-out (in BIDLE=0) or high more than Time-out(in BIDLE =1),
 * |[1]     |CLKTOEN   |Cumulative Clock Low Time Out Enable Bit
 * |        |          |0 = Indicates the cumulative clock low time-out detection is Disabled.
 * |        |          |1 = Indicates the cumulative clock low time-out detection is Enabled.
 * |        |          |For Master, it calculates the period from START to ACK
 * |        |          |For Slave, it calculates the period from START to STOP
 * |[2]     |BUSTOIEN  |Time-Out Interrupt Enable Bit
 * |        |          |BUSY =1.
 * |        |          |0 = Indicates the SCLK low time-out interrupt is Disabled.
 * |        |          |1 = Indicates the SCLK low time-out interrupt is Enabled.
 * |        |          |BUSY =0.
 * |        |          |0 = Indicates the bus IDLE time-out interrupt is Disabled.
 * |        |          |1 = Indicates the bus IDLE time-out interrupt is Enabled.
 * |[3]     |CLKTOIEN  |Extended Clock Time Out Interrupt Enable Bit
 * |        |          |0 = Indicates the time extended interrupt is Disabled.
 * |        |          |1 = Indicates the time extended interrupt is Enabled.
 * |[4]     |TORSTEN   |Time Out Reset Enable Bit
 * |        |          |0 = Indicates the I2C state machine reset is Disable.
 * |        |          |1 = Indicates the I2C state machine reset is Enable. (The clock and data bus will be released to high)
 * |[5]     |PECIEN    |Packet Error Checking Byte Count Done Interrupt Enable Bit
 * |        |          |0 = Indicates the byte count done interrupt is Disabled.
 * |        |          |1 = Indicates the byte count done interrupt is Enabled.
 * |        |          |Note: This bit is used in PECEN =1.
 * @var I2C_T::BUSSTS
 * Offset: 0x4C  I2C Bus Management Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BUSY      |Bus Busy
 * |        |          |Indicates that a communication is in progress on the bus.
 * |        |          |It is set by hardware when a START condition is detected.
 * |        |          |It is cleared by hardware when a STOP condition is detected.
 * |        |          |0 = The bus is IDLE (both SCLK and SDA High).
 * |        |          |1 = The bus is busy.
 * |[1]     |BCDONE    |Byte Count Transmission/Receive Done
 * |        |          |0 = Indicates the transmission/ receive is not finished when the PECEN is set.
 * |        |          |1 = Indicates the transmission/ receive is finished when the PECEN is set.
