MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451LE6AE/mcu.h
#define OTG_INTSTS_AVLDCHGIF_Pos         (9)                                               /*!< OTG_T::INTSTS: AVLDCHGIF Position         */
#define OTG_INTSTS_AVLDCHGIF_Msk         (0x1ul << OTG_INTSTS_AVLDCHGIF_Pos)               /*!< OTG_T::INTSTS: AVLDCHGIF Mask             */

#define OTG_INTSTS_VBCHGIF_Pos           (10)                                              /*!< OTG_T::INTSTS: VBCHGIF Position           */
#define OTG_INTSTS_VBCHGIF_Msk           (0x1ul << OTG_INTSTS_VBCHGIF_Pos)                 /*!< OTG_T::INTSTS: VBCHGIF Mask               */

#define OTG_INTSTS_SECHGIF_Pos           (11)                                              /*!< OTG_T::INTSTS: SECHGIF Position           */
#define OTG_INTSTS_SECHGIF_Msk           (0x1ul << OTG_INTSTS_SECHGIF_Pos)                 /*!< OTG_T::INTSTS: SECHGIF Mask               */

#define OTG_INTSTS_SRPDETIF_Pos          (13)                                              /*!< OTG_T::INTSTS: SRPDETIF Position          */
#define OTG_INTSTS_SRPDETIF_Msk          (0x1ul << OTG_INTSTS_SRPDETIF_Pos)                /*!< OTG_T::INTSTS: SRPDETIF Mask              */

#define OTG_STATUS_OVERCUR_Pos           (0)                                               /*!< OTG_T::STATUS: OVERCUR Position           */
#define OTG_STATUS_OVERCUR_Msk           (0x1ul << OTG_STATUS_OVERCUR_Pos)                 /*!< OTG_T::STATUS: OVERCUR Mask               */

#define OTG_STATUS_IDSTS_Pos             (1)                                               /*!< OTG_T::STATUS: IDSTS Position             */
#define OTG_STATUS_IDSTS_Msk             (0x1ul << OTG_STATUS_IDSTS_Pos)                   /*!< OTG_T::STATUS: IDSTS Mask                 */

#define OTG_STATUS_SESSEND_Pos           (2)                                               /*!< OTG_T::STATUS: SESSEND Position           */
#define OTG_STATUS_SESSEND_Msk           (0x1ul << OTG_STATUS_SESSEND_Pos)                 /*!< OTG_T::STATUS: SESSEND Mask               */

#define OTG_STATUS_BVLD_Pos              (3)                                               /*!< OTG_T::STATUS: BVLD Position              */
#define OTG_STATUS_BVLD_Msk              (0x1ul << OTG_STATUS_BVLD_Pos)                    /*!< OTG_T::STATUS: BVLD Mask                  */

#define OTG_STATUS_AVLD_Pos              (4)                                               /*!< OTG_T::STATUS: AVLD Position              */
#define OTG_STATUS_AVLD_Msk              (0x1ul << OTG_STATUS_AVLD_Pos)                    /*!< OTG_T::STATUS: AVLD Mask                  */

#define OTG_STATUS_VBUSVLD_Pos           (5)                                               /*!< OTG_T::STATUS: VBUSVLD Position           */
#define OTG_STATUS_VBUSVLD_Msk           (0x1ul << OTG_STATUS_VBUSVLD_Pos)                 /*!< OTG_T::STATUS: VBUSVLD Mask               */

/**@}*/ /* OTG_CONST */
/**@}*/ /* end of OTG register group */


/*---------------------- Peripheral Direct Memory Access Controller -------------------------*/
/**
    @addtogroup PDMA Peripheral Direct Memory Access Controller(PDMA)
    Memory Mapped Structure for PDMA Controller
@{ */


typedef struct
{


/**
 * @var DSCT_T::CTL
 * Offset: 0x00/0x10/0x20/0x30/0x40/0x50/0x60/0x70/0x80/0x90/0xA0/0xB0  Descriptor Table Control Register of PDMA Channel 0~11
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |OPMODE    |PDMA Operation Mode Selection
 * |        |          |0 = Idle state: Channel is stopped or this table is complete, when PDMA finish channel table task, OPMODE will be cleared to idle state automatically.
 * |        |          |1 = Basic mode: The descriptor table only has one task.
 * |        |          |When this task is finished, the PDMA_INTSTS[x] will be asserted.
 * |        |          |2 = Scatter-Gather mode: When operating in this mode, user must give the next descriptor table address in PDMA_DSCT_NEXT register; PDMA controller will ignore this task, then load the next task to execute.
 * |        |          |3 = Reserved.
 * |        |          |Note: Before filling transfer task in the Descriptor Table, user must check if the descriptor table is complete.
 * |[2]     |TXTYPE    |Transfer Type
 * |        |          |0 = Burst transfer type.
 * |        |          |1 = Single transfer type.
 * |[6:4]   |BURSIZE   |Burst Size
 * |        |          |This field is used for peripheral to determine the burst size or used for determine the re-arbitration size.
 * |        |          |000 = 128 Transfers.
 * |        |          |001 = 64 Transfers.
 * |        |          |010 = 32 Transfers.
 * |        |          |011 = 16 Transfers.
 * |        |          |100 = 8 Transfers.
 * |        |          |101 = 4 Transfers.
 * |        |          |110 = 2 Transfers.
 * |        |          |111 = 1 Transfers.
 * |        |          |Note: This field is only useful in burst transfer type.
 * |[7]     |TBINTDIS  |Table Interrupt Disable
 * |        |          |This field can be used to decide whether to enable table interrupt or not.
 * |        |          |If the TBINTDIS bit is enabled when PDMA controller finishes transfer task, it will not generates interrupt.
 * |        |          |0 = Table interrupt Enabled.
 * |        |          |1 = Table interrupt Disabled.
 * |        |          |Note: If this bit set to '1', the TEMPTYF will not be set.
 * |[9:8]   |SAINC     |Source Address Increment
 * |        |          |This field is used to set the source address increment size.
 * |        |          |11 = No increment (fixed address).
 * |        |          |Others = Increment and size is depended on TXWIDTH selection.
 * |[11:10] |DAINC     |Destination Address Increment
 * |        |          |This field is used to set the destination address increment size.
 * |        |          |11 = No increment (fixed address).
 * |        |          |Others = Increment and size is depended on TXWIDTH selection.
 * |[13:12] |TXWIDTH   |Transfer Width Selection
 * |        |          |This field is used for transfer width.
 * |        |          |00 = One byte (8 bit) is transferred for every operation.
 * |        |          |01= One half-word (16 bit) is transferred for every operation.
 * |        |          |10 = One word (32-bit) is transferred for every operation.
 * |        |          |11 = Reserved.
 * |        |          |Note: The PDMA transfer source address (PDMA_DSCT_SA) and PDMA transfer destination address (PDMA_DSCT_DA) should be alignment under the TXWIDTH selection
 * |[29:16] |TXCNT     |Transfer Count
 * |        |          |The TXCNT represents the required number of PDMA transfer, the real transfer count is (TXCNT + 1); The maximum transfer count is 16384 , every transfer may be byte, half-word or word that is dependent on TXWIDTH field.
 * |        |          |Note: When PDMA finish each transfer data, this field will be decrease immediately.
 * @var DSCT_T::SA
 * Offset: 0x04/0x14/0x24/0x34/0x44/0x54/0x64/0x74/0x84/0x94/0xA4/0xB4  Source Address Register of PDMA Channel 0~11
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |SA        |PDMA Transfer Source Address Register
 * |        |          |This field indicates a 32-bit source address of PDMA controller.
 * @var DSCT_T::DA
 * Offset: 0x08/0x18/0x28/0x38/0x48/0x58/0x68/0x78/0x88/0x98/0xA8/0xB8  Destination Address Register of PDMA Channel 0~11
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |DA        |PDMA Transfer Destination Address Register
 * |        |          |This field indicates a 32-bit destination address of PDMA controller.
 * @var DSCT_T::NEXT
 * Offset: 0x0C/0x1C/0x2C/0x3C/0x4C/0x5C/0x6C/0x7C/0x8C/0x9C/0xAC/0xBC  First Scatter-Gather Descriptor Table Offset Address of PDMA Channel 0~11
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:2]  |NEXT      |PDMA Next Descriptor Table Offset Address Register
 * |        |          |This field indicates the offset of next descriptor table address in system memory.
 * |        |          |The system memory based address is 0x2000_0000 (PDMA_SCATBA), if the next descriptor table is 0x2000_0100, then this field must fill in 0x0100.
 * |        |          |Note1: The next descriptor table address must be word boundary.
 * |        |          |Note2: Before filled transfer task in the descriptor table, user must check if the descriptor table is complete.
 */

