MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451LE6AE/mcu.h
#define SC_TMRDAT1_2_CNT1_Pos            (0)                                        /*!< SC_T::TMRDAT1_2: CNT1 Position    */
#define SC_TMRDAT1_2_CNT1_Msk            (0xfful << SC_TMRDAT1_2_CNT1_Pos)          /*!< SC_T::TMRDAT1_2: CNT1 Msk         */

#define SC_TMRDAT1_2_CNT2_Pos            (8)                                        /*!< SC_T::TMRDAT1_2: CNT2 Position    */
#define SC_TMRDAT1_2_CNT2_Msk            (0xfful << SC_TMRDAT1_2_CNT2_Pos)          /*!< SC_T::TMRDAT1_2: CNT2 Msk         */

/**@}*/ /* SC_CONST */
/**@}*/ /* end of SC register group */


/*---------------------- Serial Peripheral Interface Controller -------------------------*/
/**
    @addtogroup SPI Serial Peripheral Interface Controller(SPI)
    Memory Mapped Structure for SPI Controller
@{ */


typedef struct
{


/**
 * @var SPI_T::CTL
 * Offset: 0x00  Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SPIEN     |SPI Transfer Control Enable Bit
 * |        |          |In Master mode, the transfer will start when there is data in the FIFO buffer after this is set to 1.
 * |        |          |In Slave mode, this device is ready to receive data when this bit is set to 1.
 * |        |          |0 = Transfer control Disabled.
 * |        |          |1 = Transfer control Enabled.
 * |        |          |Note: Before changing the configurations of SPI_CTL, SPI_CLKDIV, SPI_SSCTL and SPI_FIFOCTL registers, user shall clear the SPIEN (SPI_CTL[0]) and confirm the SPIENSTS (SPI_STATUS[15]) is 0.
 * |[1]     |RXNEG     |Receive On Negative Edge
 * |        |          |0 = Received data input signal is latched on the rising edge of SPI bus clock.
 * |        |          |1 = Received data input signal is latched on the falling edge of SPI bus clock.
 * |[2]     |TXNEG     |Transmit On Negative Edge
 * |        |          |0 = Transmitted data output signal is changed on the rising edge of SPI bus clock.
 * |        |          |1 = Transmitted data output signal is changed on the falling edge of SP bus clock.
 * |[3]     |CLKPOL    |Clock Polarity
 * |        |          |0 = SPI bus clock is idle low.
 * |        |          |1 = SPI bus clock is idle high.
 * |[7:4]   |SUSPITV   |Suspend Interval (Master Only)
 * |        |          |The four bits provide configurable suspend interval between two successive transmit/receive transaction in a transfer.
 * |        |          |The definition of the suspend interval is the interval between the last clock edge of the preceding transaction word and the first clock edge of the following transaction word.
 * |        |          |The default value is 0x3.
 * |        |          |The period of the suspend interval is obtained according to the following equation.
 * |        |          |(SUSPITV[3:0] + 0.5) * period of SPICLK clock cycle
 * |        |          |Example:
 * |        |          |SUSPITV = 0x0 ... 0.5 SPICLK clock cycle.
 * |        |          |SUSPITV = 0x1 ... 1.5 SPICLK clock cycle.
 * |        |          |...
 * |        |          |SUSPITV = 0xE ... 14.5 SPICLK clock cycle.
 * |        |          |SUSPITV = 0xF ... 15.5 SPICLK clock cycle.
 * |[12:8]  |DWIDTH    |Data Width
 * |        |          |This field specifies how many bits can be transmitted / received in one transaction.
 * |        |          |The minimum bit length is 8 bits and can up to 32 bits.
 * |        |          |DWIDTH = 0x08 ... 8 bits.
 * |        |          |DWIDTH = 0x09 ... 9 bits.
 * |        |          |...
 * |        |          |DWIDTH = 0x1F ... 31 bits.
 * |        |          |DWIDTH = 0x00 ... 32 bits.
 * |[13]    |LSB       |Send LSB First
 * |        |          |0 = The MSB, which bit of transmit/receive register depends on the setting of DWIDTH, is transmitted/received first.
 * |        |          |1 = The LSB, bit 0 of the SPI TX register, is sent first to the SPI data output pin, and the first bit received from the SPI data input pin will be put in the LSB position of the RX register (bit 0 of SPI_RX).
 * |[16]    |TWOBIT    |2-Bit Transfer Mode Enable Bit (Only Supported in SPI0)
 * |        |          |0 = 2-Bit Transfer mode Disabled.
 * |        |          |1 = 2-Bit Transfer mode Enabled.
 * |        |          |Note: When 2-Bit Transfer mode is enabled, the first serial transmitted bit data is from the first FIFO buffer data, and the 2nd
 * |        |          |serial transmitted bit data is from the second FIFO buffer data.
 * |        |          |As the same as transmitted function, the first received bit data is stored into the first FIFO buffer and the 2nd received bit data is stored into the second FIFO buffer at the same time.
 * |[17]    |UNITIEN   |Unit Transfer Interrupt Enable Bit
 * |        |          |0 = SPI unit transfer interrupt Disabled.
 * |        |          |1 = SPI unit transfer interrupt Enabled.
 * |[18]    |SLAVE     |Slave Mode Control
 * |        |          |0 = Master mode.
 * |        |          |1 = Slave mode.
 * |[19]    |REORDER   |Byte Reorder Function Enable Bit
 * |        |          |0 = Byte Reorder function Disabled.
 * |        |          |1 = Byte Reorder function Enabled. A byte suspend interval will be inserted among each byte.
 * |        |          |The period of the byte suspend interval depends on the setting of SUSPITV.
 * |        |          |Note:
 * |        |          |1. Byte Reorder function is only available if DWIDTH is defined as 16, 24, and 32 bits.
 * |        |          |2. Byte Reorder function is not supported when the Quad or Dual I/O mode is enabled.
 * |[20]    |QDIODIR   |Quad Or Dual I/O Mode Direction Control (Only Supported in SPI0)
 * |        |          |0 = Quad or Dual Input mode.
 * |        |          |1 = Quad or Dual Output mode.
 * |[21]    |DUALIOEN  |Dual I/O Mode Enable Bit (Only Supported in SPI0)
 * |        |          |0 = Dual I/O mode Disabled.
 * |        |          |1 = Dual I/O mode Enabled.
 * |[22]    |QUADIOEN  |Quad I/O Mode Enable Bit (Only Supported in SPI0)
 * |        |          |0 = Quad I/O mode Disabled.
 * |        |          |1 = Quad I/O mode Enabled.
 * @var SPI_T::CLKDIV
 * Offset: 0x04  Clock Divider Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |DIVIDER   |Clock Divider
 * |        |          |The value in this field is the frequency divider for generating the peripheral clock, fspi_eclk, and the SPI bus clock of SPI master.
 * |        |          |The frequency is obtained according to the following equation.
 * |        |          | fspi_eclk = fspi_clock_src / (DIVIDER + 1)
 * |        |          |where fspi_clock_src is the peripheral clock source, which is defined in the clock control register CLK_CLKSEL2.
 * @var SPI_T::SSCTL
 * Offset: 0x08  Slave Select Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SS        |Slave Selection Control (Master Only)
 * |        |          |If AUTOSS bit is cleared to 0,
 * |        |          |0 = set the SPIn_SS line to inactive state.
 * |        |          |1 = set the SPIn_SS line to active state
 * |        |          |If the AUTOSS bit is set to 1,
 * |        |          |0 = Keep the SPIn_SS line at inactive state.
 * |        |          |1 = SPIn_SS line will be automatically driven to active state for the duration of data transfer, and will be driven to inactive state for the rest of the time.
 * |        |          |The active state of SPIn_SS is specified in SSACTPOL (SPI_SSCTL[2]).
 * |[2]     |SSACTPOL  |Slave Selection Active Polarity
 * |        |          |This bit defines the active polarity of slave selection signal (SPIn_SS).
 * |        |          |0 = The slave selection signal SPIn_SS is active low.
 * |        |          |1 = The slave selection signal SPIn_SS is active high.
 * |[3]     |AUTOSS    |Automatic Slave Selection Function Enable Bit (Master Only)
 * |        |          |0 = Automatic slave selection function Disabled.
 * |        |          |Slave selection signal will be asserted/de-asserted according to SS (SPI_SSCTL[0]).
 * |        |          |1 = Automatic slave selection function Enabled.
 * |[4]     |SLV3WIRE  |Slave 3-Wire Mode Enable Bit
 * |        |          |Slave 3-wire mode is only available in SPI0.
 * |        |          |In Slave 3-wire mode, the SPI controller can work with 3-wire interface including SPI0_CLK, SPI0_MISO, and SPI0_MOSI.
 * |        |          |0 = 4-wire bi-direction interface.
 * |        |          |1 = 3-wire bi-direction interface.
 * |[5]     |SLVTOIEN  |Slave Mode Time-Out Interrupt Enable Bit (Only Supported in SPI0)
 * |        |          |0 = Slave mode time-out interrupt Disabled.
 * |        |          |1 = Slave mode time-out interrupt Enabled.
 * |[6]     |SLVTORST  |Slave Mode Time-Out Reset Control (Only Supported in SPI0)
 * |        |          |0 = When Slave mode time-out event occurs, the TX and RX control circuit will not be reset.
 * |        |          |1 = When Slave mode time-out event occurs, the TX and RX control circuit will be reset by hardware.
 * |[8]     |SLVBEIEN  |Slave Mode Bit Count Error Interrupt Enable Bit
 * |        |          |0 = Slave mode bit count error interrupt Disabled.
 * |        |          |1 = Slave mode bit count error interrupt Enabled.
 * |[9]     |SLVURIEN  |Slave Mode TX Under Run Interrupt Enable Bit
 * |        |          |0 = Slave mode TX under run interrupt Disabled.
 * |        |          |1 = Slave mode TX under run interrupt Enabled.
 * |[12]    |SSACTIEN  |Slave Select Active Interrupt Enable Bit
 * |        |          |0 = Slave select active interrupt Disabled.
 * |        |          |1 = Slave select active interrupt Enabled.
 * |[13]    |SSINAIEN  |Slave Select Inactive Interrupt Enable Bit
 * |        |          |0 = Slave select inactive interrupt Disabled.
 * |        |          |1 = Slave select inactive interrupt Enabled.
 * |[31:16] |SLVTOCNT  |Slave Mode Time-Out Period (Only Supported in SPI0)
 * |        |          |In Slave mode, these bits indicate the time-out period when there is bus clock input during slave select active.
 * |        |          |The clock source of the time-out counter is Slave peripheral clock.
 * |        |          |If the value is 0, it indicates the slave mode time-out function is disabled.
 * @var SPI_T::PDMACTL
 * Offset: 0x0C  SPI PDMA Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |TXPDMAEN  |Transmit PDMA Enable Bit
 * |        |          |0 = Transmit PDMA function Disabled.
 * |        |          |1 = Transmit PDMA function Enabled.
 * |        |          |Note: In SPI master mode with full duplex transfer, if both TX and RX PDMA functions are enabled, RX PDMA function cannot be enabled prior to TX PDMA function.
 * |        |          |User can enable TX PDMA function firstly or enable both functions simultaneously.
 * |[1]     |RXPDMAEN  |Receive PDMA Enable Bit
 * |        |          |0 = Receiver PDMA function Disabled.
 * |        |          |1 = Receiver PDMA function Enabled.
 * |[2]     |PDMARST   |PDMA Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the PDMA control logic of the SPI controller. This bit will be automatically cleared to 0.
 * @var SPI_T::FIFOCTL
 * Offset: 0x10  SPI FIFO Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RXRST     |Receive Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset receive FIFO pointer and receive circuit. The RXFULL bit will be cleared to 0 and the RXEMPTY bit will be set to 1.
 * |        |          |This bit will be cleared to 0 by hardware about 3 system clock cycles + 3 peripheral clock cycles after it is set to 1.
 * |        |          |User can read TXRXRST (SPI_STATUS[23]) to check if reset is accomplished or not.
 * |        |          |Note: If there is slave receive time-out event, the RXRST will be set 1 when the SLVTORST (SPI_SSCTL[6]) is enabled.
 * |[1]     |TXRST     |Transmit Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset transmit FIFO pointer and transmit circuit. The TXFULL bit will be cleared to 0 and the TXEMPTY bit will be set to 1.
 * |        |          |This bit will be cleared to 0 by hardware about 3 system clock cycles + 3 peripheral clock cycles after it is set to 1.
 * |        |          |User can read TXRXRST (SPI_STATUS[23]) to check if reset is accomplished or not.
 * |        |          |Note: If there is slave receive time-out event, the TXRST will be set to 1 when the SLVTORST (SPI_SSCTL[6]) is enabled.
 * |[2]     |RXTHIEN   |Receive FIFO Threshold Interrupt Enable Bit
 * |        |          |0 = RX FIFO threshold interrupt Disabled.
 * |        |          |1 = RX FIFO threshold interrupt Enabled.
 * |[3]     |TXTHIEN   |Transmit FIFO Threshold Interrupt Enable Bit
 * |        |          |0 = TX FIFO threshold interrupt Disabled.
 * |        |          |1 = TX FIFO threshold interrupt Enabled.
 * |[4]     |RXTOIEN   |Slave Receive Time-Out Interrupt Enable Bit
 * |        |          |0 = Receive time-out interrupt Disabled.
 * |        |          |1 = Receive time-out interrupt Enabled.
 * |[5]     |RXOVIEN   |Receive FIFO Overrun Interrupt Enable Bit
 * |        |          |0 = Receive FIFO overrun interrupt Disabled.
 * |        |          |1 = Receive FIFO overrun interrupt Enabled.
 * |[6]     |TXUFPOL   |TX Underflow Data Polarity
 * |        |          |0 = The SPI data out is keep 0 if there is TX underflow event in Slave mode.
 * |        |          |1 = The SPI data out is keep 1 if there is TX underflow event in Slave mode.
 * |        |          |Note: The TX underflow event occurs if there is not any data in TX FIFO when the slave selection signal is active.
 * |[7]     |TXUFIEN   |TX Underflow Interrupt Enable Bit
 * |        |          |In Slave mode, when TX underflow event occurs, this interrupt flag will be set to 1.
 * |        |          |0 = Slave TX underflow interrupt Disabled.
 * |        |          |1 = Slave TX underflow interrupt Enabled.
 * |[8]     |RXFBCLR   |Receive FIFO Buffer Clear
 * |        |          |0 = No effect.
 * |        |          |1 = Clear receive FIFO pointer. The RXFULL bit will be cleared to 0 and the RXEMPTY bit will be set to 1.
 * |        |          |This bit will be cleared to 0 by hardware about 1 system clock after it is set to 1.
 * |        |          |Note: The RX shift register will not be cleared.
 * |[9]     |TXFBCLR   |Transmit FIFO Buffer Clear
 * |        |          |0 = No effect.
 * |        |          |1 = Clear transmit FIFO pointer. The TXFULL bit will be cleared to 0 and the TXEMPTY bit will be set to 1.
 * |        |          |This bit will be cleared to 0 by hardware about 1 system clock after it is set to 1.
 * |        |          |Note: The TX shift register will not be cleared.
 * |[26:24] |RXTH      |Receive FIFO Threshold
 * |        |          |If the valid data count of the receive FIFO buffer is larger than the RXTH setting, the RXTHIF bit will be set to 1, else the RXTHIF bit will be cleared to 0.
 * |        |          |In SPI0, RXTH is a 3-bit wide configuration; in SPI1 and SPI2, 2-bit wide only (SPI_FIFOCTL[25:24]).
 * |[30:28] |TXTH      |Transmit FIFO Threshold
 * |        |          |If the valid data count of the transmit FIFO buffer is less than or equal to the TXTH setting, the TXTHIF bit will be set to 1, else the TXTHIF bit will be cleared to 0.
 * |        |          |In SPI0, TXTH is a 3-bit wide configuration; in SPI1 and SPI2, 2-bit wide only (SPI_FIFOCTL[29:28]).
 * @var SPI_T::STATUS
 * Offset: 0x14  SPI Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |BUSY      |Busy Status (Read Only)
 * |        |          |0 = SPI controller is in idle state.
 * |        |          |1 = SPI controller is in busy state.
 * |        |          |The following listing are the bus busy conditions:
 * |        |          |a. SPI_CTL[0] = 1 and the TXEMPTY = 0.
 * |        |          |b. For SPI Master mode, the TXEMPTY = 1 but the current transaction is not finished yet.
 * |        |          |c. For SPI Slave mode, the SPI_CTL[0] = 1 and there is serial clock input into the SPI core logic when slave select is active.
 * |        |          |d. For SPI Slave mode, the SPI_CTL[0] = 1 and the transmit buffer or transmit shift register is not empty even if the slave select is inactive.
 * |[1]     |UNITIF    |Unit Transfer Interrupt Flag
 * |        |          |0 = No transaction has been finished since this bit was cleared to 0.
 * |        |          |1 = SPI controller has finished one unit transfer.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[2]     |SSACTIF   |Slave Select Active Interrupt Flag
 * |        |          |0 = Slave select active interrupt was cleared or not occurred.
 * |        |          |1 = Slave select active interrupt event occurred.
 * |        |          |Note: Only available in Slave mode. This bit will be cleared by writing 1 to it.
 * |[3]     |SSINAIF   |Slave Select Inactive Interrupt Flag
 * |        |          |0 = Slave select inactive interrupt was cleared or not occurred.
 * |        |          |1 = Slave select inactive interrupt event occurred.
 * |        |          |Note: Only available in Slave mode. This bit will be cleared by writing 1 to it.
 * |[4]     |SSLINE    |Slave Select Line Bus Status (Read Only)
 * |        |          |0 = The slave select line status is 0.
 * |        |          |1 = The slave select line status is 1.
 * |        |          |Note: This bit is only available in Slave mode.
 * |        |          |If SSACTPOL (SPI_SSCTL[2]) is set 0, and the SSLINE is 1, the SPI slave select is in inactive status.
 * |[5]     |SLVTOIF   |Slave Time-Out Interrupt Flag (Only Supported in SPI0)
 * |        |          |When the Slave Select is active and the value of SLVTOCNT is not 0, as the bus clock is detected, the slave time-out counter in SPI controller logic will be started.
 * |        |          |When the value of time-out counter is greater than or equal to the value of SLVTOCNT (SPI_SSCTL[31:16]) before one transaction is done, the slave time-out interrupt event will be asserted.
 * |        |          |0 = Slave time-out is not active.
 * |        |          |1 = Slave time-out is active.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[6]     |SLVBEIF   |Slave Mode Bit Count Error Interrupt Flag
 * |        |          |In Slave mode, when the slave select line goes to inactive state, if bit counter is mismatch with DWIDTH, this interrupt flag will be set to 1.
 * |        |          |0 = No Slave mode bit count error event.
 * |        |          |1 = Slave mode bit count error event occurs.
 * |        |          |Note: If the slave select active but there is no any bus clock input, the SLVBCEIF also active when the slave select goes to inactive state.
 * |        |          |This bit will be cleared by writing 1 to it.
 * |[7]     |SLVURIF   |Slave Mode TX Under Run Interrupt Flag
 * |        |          |In Slave mode, if TX underflow event occurs and the slave select line goes to inactive state, this interrupt flag will be set to 1.
 * |        |          |0 = No Slave TX under run event.
 * |        |          |1 = Slave TX under run occurs.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[8]     |RXEMPTY   |Receive FIFO Buffer Empty Indicator (Read Only)
 * |        |          |0 = Receive FIFO buffer is not empty.
 * |        |          |1 = Receive FIFO buffer is empty.
 * |[9]     |RXFULL    |Receive FIFO Buffer Full Indicator (Read Only)
 * |        |          |0 = Receive FIFO buffer is not full.
 * |        |          |1 = Receive FIFO buffer is full.
 * |[10]    |RXTHIF    |Receive FIFO Threshold Interrupt Flag (Read Only)
 * |        |          |0 = The valid data count within the RX FIFO buffer is smaller than or equal to the setting value of RXTH.
 * |        |          |1 = The valid data count within the receive FIFO buffer is larger than the setting value of RXTH.
 * |[11]    |RXOVIF    |Receive FIFO Overrun Interrupt Flag
 * |        |          |When the receive FIFO buffer is full, the follow-up data will be dropped and this bit will be set to 1.
 * |        |          |0 = No FIFO is over run.
 * |        |          |1 = Receive FIFO over run.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[12]    |RXTOIF    |Receive Time-Out Interrupt Flag
 * |        |          |0 = No receive FIFO time-out event.
 * |        |          |1 = Receive FIFO buffer is not empty and no read operation on receive FIFO buffer over 64 SPI clock period in Master mode or over 576 peripheral clock period in Slave mode.
 * |        |          |When the received FIFO buffer is read by software, the time-out status will be cleared automatically.
 * |        |          |Note: This bit will be cleared by writing 1 to it.
 * |[15]    |SPIENSTS  |SPI Enable Status (Read Only)
 * |        |          |0 = The SPI controller is disabled.
 * |        |          |1 = The SPI controller is enabled.
 * |        |          |Note: The SPI peripheral clock is asynchronous with the system clock.
 * |        |          |In order to make sure the SPI control logic is disabled, this bit indicates the real status of SPI controller.
 * |[16]    |TXEMPTY   |Transmit FIFO Buffer Empty Indicator (Read Only)
 * |        |          |0 = Transmit FIFO buffer is not empty.
 * |        |          |1 = Transmit FIFO buffer is empty.
 * |[17]    |TXFULL    |Transmit FIFO Buffer Full Indicator (Read Only)
 * |        |          |0 = Transmit FIFO buffer is not full.
 * |        |          |1 = Transmit FIFO buffer is full.
 * |[18]    |TXTHIF    |Transmit FIFO Threshold Interrupt Flag (Read Only)
 * |        |          |0 = The valid data count within the transmit FIFO buffer is larger than the setting value of TXTH.
 * |        |          |1 = The valid data count within the transmit FIFO buffer is less than or equal to the setting value of TXTH.
 * |[19]    |TXUFIF    |TX Underflow Interrupt Flag
 * |        |          |When the TX underflow event occurs, this bit will be set to 1, the state of data output pin depends on the setting of TXUFPOL.
 * |        |          |0 = No effect.
 * |        |          |1 = No data in Transmit FIFO and TX shift register when the slave selection signal is active.
 * |        |          |Note 1: This bit will be cleared by writing 1 to it.
 * |        |          |Note 2: If reset slave's transmission circuit when slave selection signal is active, this flag will be set to 1 after 2 peripheral clock cycles + 3 system clock cycles since the reset operation is done.
 * |[23]    |TXRXRST   |TX or RX Reset Status (Read Only)
 * |        |          |0 = The reset function of TXRST or RXRST is done.
 * |        |          |1 = Doing the reset function of TXRST or RXRST.
 * |        |          |Note: Both the reset operations of TXRST and RXRST need 3 system clock cycles + 2 peripheral clock cycles.
