MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451LE6AE/mcu.h
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PA8MFP    |PA.8 Multi-function Pin Selection
 * |[7:4]   |PA9MFP    |PA.9 Multi-function Pin Selection
 * |[11:8]  |PA10MFP   |PA.10 Multi-function Pin Selection
 * |[15:12] |PA11MFP   |PA.11 Multi-function Pin Selection
 * |[19:16] |PA12MFP   |PA.12 Multi-function Pin Selection
 * |[23:20] |PA13MFP   |PA.13 Multi-function Pin Selection
 * |[27:24] |PA14MFP   |PA.14 Multi-function Pin Selection
 * |[31:28] |PA15MFP   |PA.15 Multi-function Pin Selection
 * @var SYS_T::GPB_MFPL
 * Offset: 0x38  GPIOB Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PB0MFP    |PB.0 Multi-function Pin Selection
 * |[7:4]   |PB1MFP    |PB.1 Multi-function Pin Selection
 * |[11:8]  |PB2MFP    |PB.2 Multi-function Pin Selection
 * |[15:12] |PB3MFP    |PB.3 Multi-function Pin Selection
 * |[19:16] |PB4MFP    |PB.4 Multi-function Pin Selection
 * |[23:20] |PB5MFP    |PB.5 Multi-function Pin Selection
 * |[27:24] |PB6MFP    |PB.6 Multi-function Pin Selection
 * |[31:28] |PB7MFP    |PB.7 Multi-function Pin Selection
 * @var SYS_T::GPB_MFPH
 * Offset: 0x3C  GPIOB High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PB8MFP    |PB.8 Multi-function Pin Selection
 * |[7:4]   |PB9MFP    |PB.9 Multi-function Pin Selection
 * |[11:8]  |PB10MFP   |PB.10 Multi-function Pin Selection
 * |[15:12] |PB11MFP   |PB.11 Multi-function Pin Selection
 * |[19:16] |PB12MFP   |PB.12 Multi-function Pin Selection
 * |[23:20] |PB13MFP   |PB.13 Multi-function Pin Selection
 * |[27:24] |PB14MFP   |PB.14 Multi-function Pin Selection
 * |[31:28] |PB15MFP   |PB.15 Multi-function Pin Selection
 * @var SYS_T::GPC_MFPL
 * Offset: 0x40  GPIOC Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PC0MFP    |PC.0 Multi-function Pin Selection
 * |[7:4]   |PC1MFP    |PC.1 Multi-function Pin Selection
 * |[11:8]  |PC2MFP    |PC.2 Multi-function Pin Selection
 * |[15:12] |PC3MFP    |PC.3 Multi-function Pin Selection
 * |[19:16] |PC4MFP    |PC.4 Multi-function Pin Selection
 * |[23:20] |PC5MFP    |PC.5 Multi-function Pin Selection
 * |[27:24] |PC6MFP    |PC.6 Multi-function Pin Selection
 * |[31:28] |PC7MFP    |PC.7 Multi-function Pin Selection
 * @var SYS_T::GPC_MFPH
 * Offset: 0x44  GPIOC High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PC8MFP    |PC.8 Multi-function Pin Selection
 * |[7:4]   |PC9MFP    |PC.9 Multi-function Pin Selection
 * |[11:8]  |PC10MFP   |PC.10 Multi-function Pin Selection
 * |[15:12] |PC11MFP   |PC.11 Multi-function Pin Selection
 * |[19:16] |PC12MFP   |PC.12 Multi-function Pin Selection
 * |[23:20] |PC13MFP   |PC.13 Multi-function Pin Selection
 * |[27:24] |PC14MFP   |PC.14 Multi-function Pin Selection
 * |[31:28] |PC15MFP   |PC.15 Multi-function Pin Selection
 * @var SYS_T::GPD_MFPL
 * Offset: 0x48  GPIOD Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PD0MFP    |PD.0 Multi-function Pin Selection
 * |[7:4]   |PD1MFP    |PD.1 Multi-function Pin Selection
 * |[11:8]  |PD2MFP    |PD.2 Multi-function Pin Selection
 * |[15:12] |PD3MFP    |PD.3 Multi-function Pin Selection
 * |[19:16] |PD4MFP    |PD.4 Multi-function Pin Selection
 * |[23:20] |PD5MFP    |PD.5 Multi-function Pin Selection
 * |[27:24] |PD6MFP    |PD.6 Multi-function Pin Selection
 * |[31:28] |PD7MFP    |PD.7 Multi-function Pin Selection
 * @var SYS_T::GPD_MFPH
 * Offset: 0x4C  GPIOD High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PD8MFP    |PD.8 Multi-function Pin Selection
 * |[7:4]   |PD9MFP    |PD.9 Multi-function Pin Selection
 * |[11:8]  |PD10MFP   |PD.10 Multi-function Pin Selection
 * |[15:12] |PD11MFP   |PD.11 Multi-function Pin Selection
 * |[19:16] |PD12MFP   |PD.12 Multi-function Pin Selection
 * |[23:20] |PD13MFP   |PD.13 Multi-function Pin Selection
 * |[27:24] |PD14MFP   |PD.14 Multi-function Pin Selection
 * |[31:28] |PD15MFP   |PD.15 Multi-function Pin Selection
 * @var SYS_T::GPE_MFPL
 * Offset: 0x50  GPIOE Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PE0MFP    |PE.0 Multi-function Pin Selection
 * |[7:4]   |PE1MFP    |PE.1 Multi-function Pin Selection
 * |[11:8]  |PE2MFP    |PE.2 Multi-function Pin Selection
 * |[15:12] |PE3MFP    |PE.3 Multi-function Pin Selection
 * |[19:16] |PE4MFP    |PE.4 Multi-function Pin Selection
 * |[23:20] |PE5MFP    |PE.5 Multi-function Pin Selection
 * |[27:24] |PE6MFP    |PE.6 Multi-function Pin Selection
 * |[31:28] |PE7MFP    |PE.7 Multi-function Pin Selection
 * @var SYS_T::GPE_MFPH
 * Offset: 0x54  GPIOE High Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PE8MFP    |PE.8 Multi-function Pin Selection
 * |[7:4]   |PE9MFP    |PE.9 Multi-function Pin Selection
 * |[11:8]  |PE10MFP   |PE.10 Multi-function Pin Selection
 * |[15:12] |PE11MFP   |PE.11 Multi-function Pin Selection
 * |[19:16] |PE12MFP   |PE.12 Multi-function Pin Selection
 * |[23:20] |PE13MFP   |PE.13 Multi-function Pin Selection
 * |[27:24] |PE14_MFP  |PE.14 Multi-function Pin Selection
 * @var SYS_T::GPF_MFPL
 * Offset: 0x58  GPIOF Low Byte Multiple Function Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |PF0MFP    |PF.0 Multi-function Pin Selection
 * |[7:4]   |PF1MFP    |PF.1 Multi-function Pin Selection
 * |[11:8]  |PF2MFP    |PF.2 Multi-function Pin Selection
 * |[15:12] |PF3MFP    |PF.3 Multi-function Pin Selection
 * |[19:16] |PF4MFP    |PF.4 Multi-function Pin Selection
 * |[23:20] |PF5MFP    |PF.5 Multi-function Pin Selection
 * |[27:24] |PF6MFP    |PF.6 Multi-function Pin Selection
 * |[31:28] |PF7MFP    |PF.7 Multi-function Pin Selection
 * @var SYS_T::SRAM_INTCTL
 * Offset: 0xC0  System SRAM Interrupt Enable Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PERRIEN   |SRAM Parity Check Error Interrupt Enable Bit
 * |        |          |0 = SRAM parity check error interrupt Disabled.
 * |        |          |1 = SRAM parity check error interrupt Enabled.
 * @var SYS_T::SRAM_STATUS
 * Offset: 0xC4  System SRAM Parity Error Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PERRIF    |SRAM Parity Check Error Flag
 * |        |          |0 = No System SRAM parity error.
 * |        |          |1 = System SRAM parity error occur.
 * @var SYS_T::SRAM_ERRADDR
 * Offset: 0xC8  System SRAM Parity Check Error Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ERRADDR   |System SRAM Parity Error Address
 * |        |          |This register shows system SRAM parity error byte address.
 * @var SYS_T::SRAM_BISTCTL
 * Offset: 0xD0  System SRAM BIST Test Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SRBIST0   |1st
 * |        |          |SRAM BIST Enable Bit
 * |        |          |This bit enables BIST test for SRAM located in address 0x2000_0000 ~0x2000_3FFF
 * |        |          |0 = system SRAM BIST Disabled.
 * |        |          |1 = system SRAM BIST Enabled.
 * |[1]     |SRBIST1   |2nd
 * |        |          |SRAM BIST Enable Bit
 * |        |          |This bit enables BIST test for SRAM located in address 0x2000_4000 ~0x2000_7FFF
 * |        |          |0 = system SRAM BIST Disabled.
 * |        |          |1 = system SRAM BIST Enabled.
 * |[2]     |CRBIST    |CACHE BIST Enable Bit
 * |        |          |This bit enables BIST test for CACHE RAM
 * |        |          |0 = system CACHE BIST Disabled.
 * |        |          |1 = system CACHE BIST Enabled.
 * |[3]     |CANBIST   |CAN BIST Enable Bit
 * |        |          |This bit enables BIST test for CAN RAM
 * |        |          |0 = system CAN BIST Disabled.
 * |        |          |1 = system CAN BIST Enabled.
 * |[4]     |USBBIST   |USB BIST Enable Bit
 * |        |          |This bit enables BIST test for USB RAM
 * |        |          |0 = system USB BIST Disabled.
 * |        |          |1 = system USB BIST Enabled.
 * @var SYS_T::SRAM_BISTSTS
 * Offset: 0xD4  System SRAM BIST Test Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SRBISTEF0 |1st System SRAM BIST Fail Flag
 * |        |          |0 = 1st system SRAM BIST test pass.
 * |        |          |1 = 1st system SRAM BIST test fail.
 * |[1]     |SRBISTEF1 |2nd System SRAM BIST Fail Flag
 * |        |          |0 = 2nd system SRAM BIST test pass.
 * |        |          |1 = 2nd system SRAM BIST test fail.
 * |[2]     |CRBISTEF  |CACHE SRAM BIST Fail Flag
 * |        |          |0 = System CACHE RAM BIST test pass.
 * |        |          |1 = System CACHE RAM BIST test fail.
 * |[3]     |CANBEF    |CAN SRAM BIST Fail Flag
 * |        |          |0 = CAN SRAM BIST test pass.
 * |        |          |1 = CAN SRAM BIST test fail.
 * |[4]     |USBBEF    |USB SRAM BIST Fail Flag
 * |        |          |0 = USB SRAM BIST test pass.
 * |        |          |1 = USB SRAM BIST test fail.
 * |[16]    |SRBEND0   |1st SRAM BIST Test Finish
 * |        |          |0 = 1st system SRAM BIST active.
 * |        |          |1 = 1st system SRAM BIST finish.
 * |[17]    |SRBEND1   |2nd SRAM BIST Test Finish
 * |        |          |0 = 2nd system SRAM BIST is active.
 * |        |          |1 = 2nd system SRAM BIST finish.
 * |[18]    |CRBEND    |CACHE SRAM BIST Test Finish
 * |        |          |0 = System CACHE RAM BIST is active.
 * |        |          |1 = System CACHE RAM BIST test finish.
 * |[19]    |CANBEND   |CAN SRAM BIST Test Finish
 * |        |          |0 = CAN SRAM BIST is active.
 * |        |          |1 = CAN SRAM BIST test finish.
 * |[20]    |USBBEND   |USB SRAM BIST Test Finish
 * |        |          |0 = USB SRAM BIST is active.
 * |        |          |1 = USB SRAM BIST test finish.
 * @var SYS_T::IRCTCTL
 * Offset: 0xF0  IRC Trim Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |FREQSEL   |Trim Frequency Selection
 * |        |          |This field indicates the target frequency of internal 22.1184 MHz high-speed oscillator auto trim.
 * |        |          |During auto trim operation, if clock error detected with CESTOPEN is set to 1 or trim retry limitation count reached, this field will be cleared to 00 automatically.
 * |        |          |00 = Disable HIRC auto trim function.
 * |        |          |01 = Enable HIRC auto trim function and trim HIRC to 22.1184 MHz.
 * |        |          |10 = Enable HIRC auto trim function and trim HIRC to 24 MHz.
 * |        |          |11 = Reserved.
 * |[5:4]   |LOOPSEL   |Trim Calculation Loop Selection
 * |        |          |This field defines that trim value calculation is based on how many 32.768 kHz clock.
 * |        |          |00 = Trim value calculation is based on average difference in 4 32.768 kHz clock.
 * |        |          |01 = Trim value calculation is based on average difference in 8 32.768 kHz clock.
 * |        |          |10 = Trim value calculation is based on average difference in 16 32.768 kHz clock.
 * |        |          |11 = Trim value calculation is based on average difference in 32 32.768 kHz clock.
 * |        |          |Note: For example, if LOOPSEL is set as 00, auto trim circuit will calculate trim value based on the average frequency difference in 4 32.768 kHz clock.
 * |[7:6]   |RETRYCNT  |Trim Value Up2025-06-03 Limitation Count
 * |        |          |This field defines that how many times the auto trim circuit will try to up2025-06-03 the HIRC trim value before the frequency of HIRC locked.
 * |        |          |Once the HIRC locked, the internal trim value up2025-06-03 counter will be reset.
 * |        |          |If the trim value up2025-06-03 counter reached this limitation value and frequency of HIRC still doesn't lock, the auto trim operation will be disabled and FREQSEL will be cleared to 00.
 * |        |          |00 = Trim retry count limitation is 64 loops.
 * |        |          |01 = Trim retry count limitation is 128 loops.
 * |        |          |10 = Trim retry count limitation is 256 loops.
 * |        |          |11 = Trim retry count limitation is 512 loops.
 * |[8]     |CESTOPEN  |Clock Error Stop Enable Bit
 * |        |          |0 = The trim operation is keep going if clock is inaccuracy.
 * |        |          |1 = The trim operation is stopped if clock is inaccuracy.
 * @var SYS_T::IRCTIEN
 * Offset: 0xF4  IRC Trim Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |TFAILIEN  |Trim Failure Interrupt Enable Bit
 * |        |          |This bit controls if an interrupt will be triggered while HIRC trim value up2025-06-03 limitation count reached and HIRC frequency still not locked on target frequency set by FREQSEL(SYS_IRCTCTL[1:0]).
 * |        |          |If this bit is high and TFAILIF(SYS_IRCTSTS[1]) is set during auto trim operation, an interrupt will be triggered to notify that HIRC trim value up2025-06-03 limitation count was reached.
 * |        |          |0 = Disable TFAILIF(SYS_IRCTSTS[1]) status to trigger an interrupt to CPU.
 * |        |          |1 = Enable TFAILIF(SYS_IRCTSTS[1]) status to trigger an interrupt to CPU.
 * |[2]     |CLKEIEN   |Clock Error Interrupt Enable Bit
 * |        |          |This bit controls if CPU would get an interrupt while clock is inaccuracy during auto trim operation.
 * |        |          |If this bit is set to1, and CLKERRIF(SYS_IRCTSTS[2]) is set during auto trim operation, an interrupt will be triggered to notify the clock frequency is inaccuracy.
 * |        |          |0 = Disable CLKERRIF(SYS_IRCTSTS[2]) status to trigger an interrupt to CPU.
 * |        |          |1 = Enable CLKERRIF(SYS_IRCTSTS[2]) status to trigger an interrupt to CPU.
 * @var SYS_T::IRCTISTS
 * Offset: 0xF8  IRC Trim Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |FREQLOCK  |HIRC Frequency Lock Status
 * |        |          |This bit indicates the internal 22.1184 MHz high-speed oscillator frequency is locked.
 * |        |          |This is a status bit and doesn't trigger any interrupt.
 * |[1]     |TFAILIF   |Trim Failure Interrupt Status
 * |        |          |This bit indicates that internal 22.1184 MHz high-speed oscillator trim value up2025-06-03 limitation count reached and the internal 22.1184 MHz high-speed oscillator clock frequency still doesn't be locked.
 * |        |          |Once this bit is set, the auto trim operation stopped and FREQSEL(SYS_iRCTCTL[1:0]) will be cleared to 00 by hardware automatically.
 * |        |          |If this bit is set and TFAILIEN(SYS_IRCTIEN[1]) is high, an interrupt will be triggered to notify that HIRC trim value up2025-06-03 limitation count was reached.
 * |        |          |Write 1 to clear this to 0.
 * |        |          |0 = Trim value up2025-06-03 limitation count does not reach.
 * |        |          |1 = Trim value up2025-06-03 limitation count reached and internal 22.1184 MHz high-speed oscillator frequency still not locked.
 * |[2]     |CLKERRIF  |Clock Error Interrupt Status
 * |        |          |When the frequency of external 32.768 kHz low-speed crystal or internal 22.1184 MHz high-speed oscillator is shift larger to unreasonable value, this bit will be set and to be an indicate that clock frequency is inaccuracy
 * |        |          |Once this bit is set to 1, the auto trim operation stopped and FREQSEL(SYS_IRCTCL[1:0]) will be cleared to 00 by hardware automatically if CESTOPEN(SYS_IRCTCTL[8]) is set to 1.
 * |        |          |If this bit is set and CLKEIEN(SYS_IRCTIEN[2]) is high, an interrupt will be triggered to notify the clock frequency is inaccuracy.
 * |        |          |Write 1 to clear this to 0.
 * |        |          |0 = Clock frequency is accuracy.
 * |        |          |1 = Clock frequency is inaccuracy.
 * @var SYS_T::REGLCTL
 * Offset: 0x100  Register Lock Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |REGLCTL   |Register Lock Control Code
 * |        |          |Write operation:
 * |        |          |Some registers have write-protection function.
 * |        |          |Writing these registers have to disable the protected function by writing the sequence value "59h", "16h", "88h" to this field.
 * |        |          |After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.
 * |        |          |Read operation:
 * |        |          |0 = Write-protection Enabled for writing protected registers.
 * |        |          |Any write to the protected register is ignored.
 * |        |          |1 = Write-protection Disabled for writing protected registers.
 * |        |          |The Protected registers are:
 * |        |          |SYS_IPRST0: address 0x4000_0008
 * |        |          |SYS_BODCTL: address 0x4000_0018
 * |        |          |SYS_PORCTL: address 0x4000_0024
 * |        |          |SYS_VREFCTL: address 0x4000_0028
 * |        |          |SYS_USBPHY: address 0x4000_002C
 * |        |          |CLK_PWRCTL: address 0x4000_0200 (bit[6] is not protected for power wake-up interrupt clear)
 * |        |          |SYS_SRAM_BISTCTL: address 0x4000_00D0
 * |        |          |CLK_APBCLK0 [0]: address 0x4000_0208 (bit[0] is watchdog clock enable)
 * |        |          |CLK_CLKSEL0: address 0x4000_0210 (for HCLK and CPU STCLK clock source select)
 * |        |          |CLK_CLKSEL1 [1:0]: address 0x4000_0214 (for watchdog clock source select)
 * |        |          |CLK_CLKSEL1 [31:30]: address 0x4000_0214 (for window watchdog clock source select)
 * |        |          |CLK_CLKDSTS: address 0x4000_0274
 * |        |          |NMIEN: address 0x4000_0300
 * |        |          |FMC_ISPCTL: address 0x4000_C000 (Flash ISP Control register)
 * |        |          |FMC_ISPTRG: address 0x4000_C010 (ISP Trigger Control register)
 * |        |          |FMC_ISPSTS: address 0x4000_C040
 * |        |          |WDT_CTL: address 0x4004_0000
 * |        |          |FMC_FTCTL: address 0x4000_5018
 * |        |          |FMC_ICPCMD: address 0x4000_501C
 * |        |          |CLK_PLLCTL: address 0x40000240
 * |        |          |PWM_CTL0: address 0x4005_8000
 * |        |          |PWM_CTL0: address 0x4005_9000
 * |        |          |PWM_DTCTL0_1: address 0x4005_8070
 * |        |          |PWM_DTCTL0_1: address 0x4005_9070
 * |        |          |PWM_DTCTL2_3: address 0x4005_8074
 * |        |          |PWM_DTCTL2_3: address 0x4005_9074
 * |        |          |PWM_DTCTL4_5: address 0x4005_8078
 * |        |          |PWM_DTCTL4_5: address 0x4005_9078
 * |        |          |PWM_BRKCTL0_1: address 0x4005_80C8
 * |        |          |PWM_BRKCTL0_1: address 0x4005_90C8
 * |        |          |PWM_BRKCTL2_3: address0x4005_80CC
 * |        |          |PWM_BRKCTL2_3: address0x4005_90CC
 * |        |          |PWM_BRKCTL4_5: address0x4005_80D0
 * |        |          |PWM_BRKCTL4_5: address0x4005_90D0
 * |        |          |PWM_INTEN1: address0x4005_80E4
 * |        |          |PWM_INTEN1: address0x4005_90E4
 * |        |          |PWM_INTSTS1: address0x4005_80EC
 * |        |          |PWM_INTSTS1: address0x4005_90EC
 */

