MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M451LE6AE/mcu.h
 * |[16]    |TKIF8     |TK8 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK8.
 * |        |          |1 = Threshold control event occurs with TK8.
 * |[17]    |TKIF9     |TK9 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK9.
 * |        |          |1 = Threshold control event occurs with TK9.
 * |[18]    |TKIF10    |TK10 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK10.
 * |        |          |1 = Threshold control event occurs with TK10.
 * |[19]    |TKIF11    |TK11 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK11.
 * |        |          |1 = Threshold control event occurs with TK11.
 * |[20]    |TKIF12    |TK12 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK12.
 * |        |          |1 = Threshold control event occurs with TK12.
 * |[21]    |TKIF13    |TK13 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK13.
 * |        |          |1 = Threshold control event occurs with TK13.
 * |[22]    |TKIF14    |TK14 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK14.
 * |        |          |1 = Threshold control event occurs with TK14.
 * |[23]    |TKIF15    |TK15 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK15.
 * |        |          |1 = Threshold control event occurs with TK15.
 * |[24]    |TKIF16    |TK16 Interrupt Flag
 * |        |          |This bit will be cleared by writing a "1" to this bit.
 * |        |          |0 = No threshold control event with TK16.
 * |        |          |1 = Threshold control event occurs with TK16.
 * @var TK_T::DAT0
 * Offset: 0x2C  Touch Key Data Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TKDAT0    |TK0 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN0 (TK_CTL[0]) is "0" or TKREN0 (TK_REFCTL[0]) is "1" except SCANALL (TK_REFCTL[23]) is "1".
 * |[15:8]  |TKDAT1    |TK1 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN1 (TK_CTL[1]) is "0" or TKREN1 (TK_REFCTL[1]) is "1".
 * |[23:16] |TKDAT2    |TK2 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN2 (TK_CTL[2]) is "0" or TKREN2 (TK_REFCTL[2]) is "1".
 * |[31:24] |TKDAT3    |TK3 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN3 (TK_CTL[3]) is "0" or TKREN3 (TK_REFCTL[3]) is "1".
 * @var TK_T::DAT1
 * Offset: 0x30  Touch Key Data Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TKDAT4    |TK0 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN4 (TK_CTL[4]) is "0" or TKREN4 (TK_REFCTL[4]) is "1".
 * |[15:8]  |TKDAT5    |TK5 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN5 (TK_CTL[5]) is "0" or TKREN5 (TK_REFCTL[5]) is "1".
 * |[23:16] |TKDAT6    |TK6 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN6 (TK_CTL[6]) is "0" or TKREN6 (TK_REFCTL[6]) is "1".
 * |[31:24] |TKDAT7    |TK7 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN7 (TK_CTL[7]) is "0" or TKREN7 (TK_REFCTL[7]) is "1".
 * @var TK_T::DAT2
 * Offset: 0x34  Touch Key Data Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TKDAT8    |TK8 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN8 (TK_CTL[8]) is "0" or TKREN8 (TK_REFCTL[8]) is "1".
 * |[15:8]  |TKDAT9    |TK9 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN9 (TK_CTL[9]) is "0" or TKREN9 (TK_REFCTL[9]) is "1".
 * |[23:16] |TKDAT10   |TK10 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN10 (TK_CTL[10]) is "0" or TKREN10 (TK_REFCTL[10]) is "1".
 * |[31:24] |TKDAT11   |TK11 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN11 (TK_CTL[11]) is "0" or TKREN11 (TK_REFCTL[11]) is "1".
 * @var TK_T::DAT3
 * Offset: 0x38  Touch Key Data Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TKDAT12   |TK12 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN12 (TK_CTL[12]) is "0" or TKREN12 (TK_REFCTL[12]) is "1".
 * |[15:8]  |TKDAT13   |TK13 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN13 (TK_CTL[13]) is "0" or TKREN13 (TK_REFCTL[13]) is "1".
 * |[23:16] |TKDAT14   |TK14 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN14 (TK_CTL[14]) is "0" or TKREN14 (TK_REFCTL[14]) is "1".
 * |[31:24] |TKDAT15   |TK15 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN15 (TK_CTL[15]) is "0" or TKREN15 (TK_REFCTL[15]) is "1".
 * @var TK_T::DAT4
 * Offset: 0x3C  Touch Key Data Register 4
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TKDAT16   |TK16 Sensing Result Data (Read Only)
 * |        |          |This data is invalid if TKSEN16 (TK_CTL[16]) is "0" or TKREN16 (TK_REFCTL[16]) is "1".
 * @var TK_T::INTEN
 * Offset: 0x40  Touch Key Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SCTHIEN   |Touch Key Scan Complete With High/Low Threshold Control Interrupt Enable Bit
 * |        |          |0 = Key scan complete with threshold control interrupt is disable.
 * |        |          |1 = Key scan complete with threshold control interrupt is enable.
 * |[1]     |SCINTEN   |Touch Key Scan Complete Interrupt Enable
 * |        |          |Bit
 * |        |          |0 = Key scan complete without threshold control interrupt is disable.
 * |        |          |1 = Key scan complete without threshold control interrupt is enable.
 * |[31]    |THIMOD    |Touch Key Threshold Interrupt Mode Select
 * |        |          |0 = Edge trigger mode.
 * |        |          |1 = Level trigger mode.
 * @var TK_T::TH0_1
 * Offset: 0x44  Touch Key TK0/TK1 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH0      |Low Threshold Of TK0
 * |        |          |Low level for TK0 threshold control.
 * |[15:8]  |HTH0      |High Threshold Of TK0
 * |        |          |High level for TK0 threshold control.
 * |[23:16] |LTH1      |Low Threshold Of TK1
 * |        |          |Low level for TK1 threshold control.
 * |[31:24] |HTH1      |High Threshold Of TK1
 * |        |          |High level for TK1 threshold control.
 * @var TK_T::TH2_3
 * Offset: 0x48  Touch Key TK2/TK3 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH2      |Low Threshold Of TK2
 * |        |          |Low level for TK2 threshold control.
 * |[15:8]  |HTH2      |High Threshold Of TK2
 * |        |          |High level for TK2 threshold control.
 * |[23:16] |LTH3      |Low Threshold Of TK3
 * |        |          |Low level for TK3 threshold control.
 * |[31:24] |HTH3      |High Threshold Of TK3
 * |        |          |High level for TK3 threshold control.
 * @var TK_T::TH4_5
 * Offset: 0x4C  Touch Key TK4/TK5 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH4      |Low Threshold Of TK4
 * |        |          |Low level for TK4 threshold control.
 * |[15:8]  |HTH4      |High Threshold Of TK4
 * |        |          |High level for TK4 threshold control.
 * |[23:16] |LTH5      |Low Threshold Of TK5
 * |        |          |Low level for TK5 threshold control.
 * |[31:24] |HTH5      |High Threshold Of TK5
 * |        |          |High level for TK5 threshold control.
 * @var TK_T::TH6_7
 * Offset: 0x50  Touch Key TK6/TK7 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH6      |Low Threshold Of TK6
 * |        |          |Low level for TK6 threshold control.
 * |[15:8]  |HTH6      |High Threshold Of TK6
 * |        |          |High level for TK6 threshold control.
 * |[23:16] |LTH7      |Low Threshold Of TK7
 * |        |          |Low level for TK7 threshold control.
 * |[31:24] |HTH7      |High Threshold Of TK7
 * |        |          |High level for TK7 threshold control.
 * @var TK_T::TH8_9
 * Offset: 0x54  Touch Key TK8/TK9 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH8      |Low Threshold Of TK8
 * |        |          |Low level for TK8 threshold control.
 * |[15:8]  |HTH8      |High Threshold Of TK8
 * |        |          |High level for TK8 threshold control.
 * |[23:16] |LTH9      |Low Threshold Of TK9
 * |        |          |Low level for TK9 threshold control.
 * |[31:24] |HTH9      |High Threshold Of TK9
 * |        |          |High level for TK9 threshold control.
 * @var TK_T::TH10_11
 * Offset: 0x58  Touch Key TK10/TK11 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH10     |Low Threshold Of TK10
 * |        |          |Low level for TK10 threshold control.
 * |[15:8]  |HTH10     |High Threshold Of TK10
 * |        |          |High level for TK10 threshold control.
 * |[23:16] |LTH11     |Low Threshold Of TK11
 * |        |          |Low level for TK11 threshold control.
 * |[31:24] |HTH11     |High Threshold Of TK11
 * |        |          |High level for TK11 threshold control.
 * @var TK_T::TH12_13
 * Offset: 0x5C  Touch Key TK12/TK13 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH12     |Low Threshold Of TK12
 * |        |          |Low level for TK12 threshold control.
 * |[15:8]  |HTH12     |High Threshold Of TK12
 * |        |          |High level for TK12 threshold control.
 * |[23:16] |LTH13     |Low Threshold Of TK13
 * |        |          |Low level for TK13 threshold control.
 * |[31:24] |HTH13     |High Threshold Of TK13
 * |        |          |High level for TK13 threshold control.
 * @var TK_T::TH14_15
 * Offset: 0x60  Touch Key TK14/TK15 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH14     |Low Threshold Of TK14
 * |        |          |Low level for TK14 threshold control.
 * |[15:8]  |HTH14     |High Threshold Of TK14
 * |        |          |High level for TK14 threshold control.
 * |[23:16] |LTH15     |Low Threshold Of TK15
 * |        |          |Low level for TK15 threshold control.
 * |[31:24] |HTH15     |High Threshold Of TK15
 * |        |          |High level for TK15 threshold control.
 * @var TK_T::TH16
 * Offset: 0x64  Touch Key TK16 Threshold Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |LTH16     |Low Threshold Of TK16
 * |        |          |Low level for TK16 threshold control.
 * |[15:8]  |HTH16     |High Threshold Of TK16
 * |        |          |High level for TK16 threshold control.
 */

    __IO uint32_t CTL;           /* Offset: 0x00  Touch Key Scan Control Register                                    */
    __IO uint32_t REFCTL;        /* Offset: 0x04  Touch Key Reference Control Register                               */
    __IO uint32_t CCBDAT0;       /* Offset: 0x08  Touch Key Complement Capacitor Bank Data Register 0                */
    __IO uint32_t CCBDAT1;       /* Offset: 0x0C  Touch Key Complement Capacitor Bank Data Register 1                */
    __IO uint32_t CCBDAT2;       /* Offset: 0x10  Touch Key Complement Capacitor Bank Data Register 2                */
    __IO uint32_t CCBDAT3;       /* Offset: 0x14  Touch Key Complement Capacitor Bank Data Register 3                */
    __IO uint32_t CCBDAT4;       /* Offset: 0x18  Touch Key Complement Capacitor Bank Data Register 4                */
    __IO uint32_t IDLESEL;       /* Offset: 0x1C  Touch Key Idle State Control Register                              */
    __IO uint32_t POLSEL;        /* Offset: 0x20  Touch Key Polarity Select Register                                 */
    __IO uint32_t POLCTL;        /* Offset: 0x24  Touch Key Polarity Control Register                                */
    __IO uint32_t STATUS;        /* Offset: 0x28  Touch Key Status Register                                          */
    __I  uint32_t DAT0;          /* Offset: 0x2C  Touch Key Data Register 0                                          */
    __I  uint32_t DAT1;          /* Offset: 0x30  Touch Key Data Register 1                                          */
    __I  uint32_t DAT2;          /* Offset: 0x34  Touch Key Data Register 2                                          */
    __I  uint32_t DAT3;          /* Offset: 0x38  Touch Key Data Register 3                                          */
    __I  uint32_t DAT4;          /* Offset: 0x3C  Touch Key Data Register 4                                          */
    __IO uint32_t INTEN;         /* Offset: 0x40  Touch Key Interrupt Enable Register                                */
    __IO uint32_t TH0_1;         /* Offset: 0x44  Touch Key TK0/TK1 Threshold Control Register                       */
    __IO uint32_t TH2_3;         /* Offset: 0x48  Touch Key TK2/TK3 Threshold Control Register                       */
    __IO uint32_t TH4_5;         /* Offset: 0x4C  Touch Key TK4/TK5 Threshold Control Register                       */
    __IO uint32_t TH6_7;         /* Offset: 0x50  Touch Key TK6/TK7 Threshold Control Register                       */
    __IO uint32_t TH8_9;         /* Offset: 0x54  Touch Key TK8/TK9 Threshold Control Register                       */
    __IO uint32_t TH10_11;       /* Offset: 0x58  Touch Key TK10/TK11 Threshold Control Register                     */
    __IO uint32_t TH12_13;       /* Offset: 0x5C  Touch Key TK12/TK13 Threshold Control Register                     */
    __IO uint32_t TH14_15;       /* Offset: 0x60  Touch Key TK14/TK15 Threshold Control Register                     */
    __IO uint32_t TH16;          /* Offset: 0x64  Touch Key TK16 Threshold Control Register                          */

} TK_T;



/**
    @addtogroup TK_CONST TK Bit Field Definition
    Constant Definitions for TK Controller
@{ */


#define TK_CTL_TKSEN0_Pos                (0)                                               /*!< TK_T::CTL: TKSEN0 Position                */
#define TK_CTL_TKSEN0_Msk                (0x1ul << TK_CTL_TKSEN0_Pos)                      /*!< TK_T::CTL: TKSEN0 Mask                    */

#define TK_CTL_TKSEN1_Pos                (1)                                               /*!< TK_T::CTL: TKSEN1 Position                */
#define TK_CTL_TKSEN1_Msk                (0x1ul << TK_CTL_TKSEN1_Pos)                      /*!< TK_T::CTL: TKSEN1 Mask                    */

#define TK_CTL_TKSEN2_Pos                (2)                                               /*!< TK_T::CTL: TKSEN2 Position                */
#define TK_CTL_TKSEN2_Msk                (0x1ul << TK_CTL_TKSEN2_Pos)                      /*!< TK_T::CTL: TKSEN2 Mask                    */

#define TK_CTL_TKSEN3_Pos                (3)                                               /*!< TK_T::CTL: TKSEN3 Position                */
#define TK_CTL_TKSEN3_Msk                (0x1ul << TK_CTL_TKSEN3_Pos)                      /*!< TK_T::CTL: TKSEN3 Mask                    */

#define TK_CTL_TKSEN4_Pos                (4)                                               /*!< TK_T::CTL: TKSEN4 Position                */
#define TK_CTL_TKSEN4_Msk                (0x1ul << TK_CTL_TKSEN4_Pos)                      /*!< TK_T::CTL: TKSEN4 Mask                    */

